[
  {
    "code": "E.AU.D2",
    "title": "E.AU.D2 Organisation-wide and cross-organisation logging and monitoring policies to ensure consistency of protocols",
    "overall_score": "75%",
    "notes": "MOSIP implements comprehensive organization-wide logging through its unified logging framework ensuring consistent protocols across all services. However, monitoring policies are not regularly reviewed for effectiveness despite comprehensive documentation being maintained.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "E.AU.D3",
    "title": "E.AU.D3 Employment of real-time monitoring",
    "overall_score": "20%",
    "notes": "MOSIP does not implement dedicated real-time security threat detection systems but includes infrastructure monitoring through service mesh and metrics collection. The platform requires external security tooling integration for comprehensive real-time security oversight capabilities.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "E.AU.D4",
    "title": "E.AU.D4 The audit trail covers the entire ID lifecycle",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive audit trail capabilities through its audit framework covering identity creation, modification and termination with detailed logging. The platform includes cryptographic utilities for audit log protection though complete implementation depends on proper configuration.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "E.AU.O1",
    "title": "E.AU.O1 How often the log is rotated",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive log rotation with configurable criteria including file size limits and time intervals using standardized logging libraries. The audit framework ensures integrity during rotation with support for centralized logging systems and long-term archival.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "E.AU.O2",
    "title": "E.AU.O2 How often does the system transfer log-data to a secure log management infrastructure?",
    "overall_score": "100%",
    "notes": "MOSIP implements real-time log transfer to centralized logging infrastructure with minimal latency using secure protocols and encryption. The platform includes integrity verification, monitoring dashboards, and delivery success tracking for log transfers.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "E.AU.O4",
    "title": "E.AU.O4 Log is transferred and stored in an encrypted format",
    "overall_score": "100%",
    "notes": "MOSIP encrypts all log data in transit using industry-standard protocols and supports encrypted storage at rest with strong encryption algorithms. The platform includes comprehensive key management with secure storage and role-based access controls for log data.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "E.DEC.D1",
    "title": "E.DEC.D1 A  Data Protection Impact Assessment (DPIA) has been developed",
    "overall_score": "100%",
    "notes": "MOSIP implements privacy-by-design and security-by-design principles with comprehensive privacy risk assessment capabilities. While no formal GDPR DPIA document exists, the platform provides extensive privacy frameworks and controls that enable organizations to conduct thorough privacy assessments.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "E.DEC.O1",
    "title": "E.DEC.O1 The system satisfies Article 29 Guidelines and the limitation provided by Article 22 of the GDPR",
    "overall_score": "100%",
    "notes": "MOSIP ensures human oversight through manual adjudication components which prevent purely automated decisions in identity verification. The open-source architecture provides transparency and allows individuals to challenge automated decisions through manual review workflows.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "E.DPP.D1",
    "title": "E.DPP.D1 Creation of a data-scoping document",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive data-scoping documentation including detailed data models, field specifications, and data classification for personal and biometric data. The platform defines clear data flow boundaries between system components with regular documentation updates through version-controlled processes.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "E.DPP.D2",
    "title": "E.DPP.D2 Description  of Prospective and Data-Structure provenance",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive data provenance tracking through its processing pipeline maintaining detailed records of data origin, transformations, and lineage. The platform captures extensive metadata and includes prospective provenance planning capabilities for predicting data transformations.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "E.DPP.D3",
    "title": "E.DPP.D3 Design of procedures to assess data-quality",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive data quality assessment through automated validation engines and quality scoring mechanisms. The platform includes systematic issue tracking with manual adjudication and continuous improvement capabilities for quality metrics monitoring.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "E.DPP.D4",
    "title": "E.DPP.D4 Provision  for data handling rules",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive data handling rules through its privacy and security frameworks covering the entire data lifecycle. The platform provides detailed data classification, role-based access controls, and configurable retention policies with automated enforcement and incident response procedures.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "E.DPP.O1",
    "title": "E.DPP.O1 Periodic verification that the collected data reside in the declared scope",
    "overall_score": "100%",
    "notes": "MOSIP implements periodic verification through its configuration management and compliance frameworks that regularly verify collected data against defined policies. The platform includes automated monitoring capabilities and audit frameworks for detecting scope deviations with systematic remediation processes.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "E.DPP.O2",
    "title": "E.DPP.O2 For each entity, a single provenance record (or summary) is kept, in a tamper proof way",
    "overall_score": "100%",
    "notes": "MOSIP maintains single comprehensive provenance records for each identity with cryptographic integrity protection and digital signatures. The platform provides complete lifecycle tracking with API-based access for audit and compliance verification.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "E.DPP.O3",
    "title": "E.DPP.O3 Maintenance of Retrospective and Process provenance",
    "overall_score": "100%",
    "notes": "MOSIP maintains comprehensive retrospective provenance through its registration processor capturing detailed historical records of all operations and transformations. The platform supports configurable retention policies and provides process provenance information accessible for forensic analysis and troubleshooting.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "E.DPP.O4",
    "title": "E.DPP.O4 Periodic evaluation of data quality",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive data quality evaluation through the registration processor with automated quality assessment and validation rules. The platform evaluates accuracy through biometric validation, completeness through mandatory field checks, and uses automated profiling tools with configurable quality thresholds and systematic correction processes.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "E.DPP.O5",
    "title": "E.DPP.O5 Deletion routines/procedures are deployed and they are executed correctly",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive deletion procedures through its data management framework with documented policies for secure data disposal and configurable retention periods. The platform ensures secure deletion mechanisms including cryptographic erasure and maintains detailed audit trails for all deletion activities while protecting deleted data confidentiality.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "E.DPP.O6",
    "title": "E.DPP.O6 Creation, deployment and continuous update of a register with data processing tools",
    "overall_score": "100%",
    "notes": "MOSIP maintains comprehensive documentation of all data processing activities through its architecture documentation and module specifications with detailed inventories of processing tools. The platform provides detailed security documentation for all processing components and maintains publicly accessible documentation portals with audit-ready information for compliance verification.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "E.E.O1",
    "title": "E.E.O1 The user can track and monitor legitimate data usage and possible misuses",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive audit capabilities through its audit framework allowing tracking of all data access and authentication events. The open-source architecture ensures transparency and supports identity lifecycle management with consent controls.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "E.E.O2",
    "title": "E.E.O2 The user can track and monitor granted and unallowed accesses",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive access tracking through its audit framework logging all access attempts including authentication events and API calls. The platform supports integration with monitoring and alerting systems while ensuring audit log integrity through cryptographic protection.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "E.OP.D2",
    "title": "E.OP.D2 Creation of a data-scoping document",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive data-scoping documentation through its architectural specifications outlining all data types, collection purposes, and processing scope. The platform documents data sensitivity classifications and defines clear system boundaries for handling sensitive information.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "E.OP.D3",
    "title": "E.OP.D3 Visibility and justifications for system parameters",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive visibility into system parameters through its configuration management framework and deployment documentation. The platform implements proper configuration management with version control, change tracking, and audit trails for all configuration modifications.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.CDM.D1",
    "title": "P.CDM.D1 Data is adequate and relevant (the purpose and rational are clear)",
    "overall_score": "100%",
    "notes": "MOSIP clearly defines data collection purposes through its privacy and data protection framework with comprehensive documentation of data collection rationale and processing purposes. The platform implements data minimization principles ensuring only adequate and relevant data is collected for identity verification.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.CDM.D2",
    "title": "P.CDM.D2 Data is minimised (boundaries are clearly stated)",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive data minimization through well-defined data collection boundaries, data classification schemes, and technical controls that limit collection to essential demographic and biometric data required for identity verification purposes.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.CDM.O1",
    "title": "P.CDM.O1 Pseudo-anonymisation of personal data",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive pseudo-anonymisation through cryptographic techniques, advanced privacy controls, and monitoring capabilities that protect personal data while maintaining utility for legitimate identity verification purposes.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.CDM.O2",
    "title": "P.CDM.O2 Deployment of recommendation algorithms",
    "overall_score": "100%",
    "notes": "MOSIP uses standard cryptographic algorithms like AES, RSA, and SHA through its cryptographic services framework. The platform follows an open-source approach with well-documented algorithms and supports HSM integration for enhanced security.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.CDM.O4",
    "title": "P.CDM.O4 Timely validation of the provenance of critical and system control data",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive validation through its audit framework, monitoring tools, and integrity controls that enable timely verification of critical data sources and system controls for cybersecurity incident detection and response.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.IDA.D1",
    "title": "P.IDA.D1 Provision for removing duplicate and false ID records / attributes",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive duplicate detection through advanced deduplication algorithms, biometric matching, data validation frameworks, manual adjudication systems, and detailed audit trails for maintaining data quality and accuracy.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.IDA.D2",
    "title": "P.IDA.D2 Provision for ID revocation",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive identity revocation through ID lifecycle management, systematic revocation procedures, detailed audit trails, integrated IAM capabilities, and complete access removal mechanisms for effective identity management.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.IDA.D3",
    "title": "P.IDA.D3 Provision for updating and re-proofing identity attributes that change over time",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive update mechanisms through ID lifecycle management, systematic re-proofing processes, data validation frameworks, multiple authentication methods, and detailed audit trails for maintaining accurate identity information over time.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.IDA.D4",
    "title": "P.IDA.D4 Provision for detecting insufficient distribution of revocation lists to distributed services",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive revocation list distribution through certificate management frameworks, systematic monitoring capabilities, automated update mechanisms, validation processes, and detailed audit trails for secure certificate management across distributed services.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.IDA.D5",
    "title": "P.IDA.D5 Controlled and consistent ID attribute data ingest processes defined",
    "overall_score": "100%",
    "notes": "MOSIP implements controlled data ingestion through well-defined workflows, comprehensive validation procedures, standardized collection methods, detailed monitoring capabilities, and data integrity mechanisms for consistent identity attribute processing.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.IDA.O1",
    "title": "P.IDA.O1 Ratio of valid data to erroneous data in the database",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive data validation, systematic monitoring, automated error handling, audit capabilities, and continuous improvement mechanisms to maintain high ratios of valid to erroneous data in the database.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.IDA.O2",
    "title": "P.IDA.O2 Attribute-based encryption applied",
    "overall_score": "100%",
    "notes": "MOSIP implements attribute-based access control and encryption through comprehensive security frameworks, cryptographic protection, multiple encryption schemes, audit capabilities, and secure key management for fine-grained identity data protection.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.IDA.O3",
    "title": "P.IDA.O3 Privileged Identity Management (PIM) services deployed",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive Privileged Identity Management with role-based access control, session management, monitoring capabilities, detailed audit trails, and secure lifecycle management for all privileged identities and administrative accounts.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.IDA.O4",
    "title": "P.IDA.O4 Inter-directory provisioning",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive inter-directory provisioning with user data synchronization, standardized protocols (LDAP, SCIM, SAML), data consistency validation, monitoring capabilities, and secure authentication for cross-system operations.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.IDA.O5",
    "title": "P.IDA.O5 All data mapped to corresponding metadata",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive data-to-metadata mapping for all identity attributes with systematic metadata management, metadata-driven validation, audit traceability, and standardized metadata frameworks for interoperability and governance.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.IDA.O6",
    "title": "P.IDA.O6 Conformance with GDPR",
    "overall_score": "75%",
    "notes": "MOSIP implements privacy-by-design principles and provides core privacy protection capabilities including consent mechanisms, data minimization, and audit trails. However, comprehensive GDPR compliance requires full implementation of individual data rights (particularly data portability) and formal compliance processes that may need additional development.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.LAR.D1",
    "title": "P.LAR.D1 Established protocols for data archiving",
    "overall_score": "100%",
    "notes": "MOSIP implements basic data lifecycle management with retention policies and secure deletion capabilities. However, formal digital archiving standards like OAIS and ISO 16363 require specific implementation and certification processes not explicitly provided by MOSIP core platform.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.LAR.D2",
    "title": "P.LAR.D2 Provision for compliance with data retention directive(s)",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive data retention through lifecycle management, secure storage mechanisms, automated deletion capabilities, audit trails, and governance frameworks for compliance with data retention directives.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.LAR.O1",
    "title": "P.LAR.O1 User retention rate",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive user analytics through observability frameworks, systematic monitoring capabilities, user experience optimization, privacy-compliant tracking mechanisms, and audit capabilities for measuring user retention and engagement.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.LAR.O2",
    "title": "P.LAR.O2 User churn rate",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive churn analysis through analytics frameworks, systematic monitoring capabilities, behavior analysis for churn prevention, privacy-compliant tracking, and detailed reporting for user retention optimization.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.LAR.O4",
    "title": "P.LAR.O4 Repeat user rate",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive repeat user tracking through analytics frameworks, systematic monitoring capabilities, retention optimization based on insights, privacy-compliant tracking mechanisms, and audit capabilities for user loyalty measurement.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.LAR.O5",
    "title": "P.LAR.O5 User participation rate",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive user participation tracking through analytics frameworks, systematic monitoring capabilities, engagement optimization, privacy-compliant interaction tracking, and audit capabilities for user involvement measurement.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.LAR.O7",
    "title": "P.LAR.O7 Compliance with European Data Protection Directive 95/46/EC",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive data protection mechanisms, explicit consent management, individual rights support, robust security measures, and compliance monitoring for adherence to European Data Protection Directive 95/46/EC requirements.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.PIA.D1",
    "title": "P.PIA.D1 Provision for a DPIA policy and review processes",
    "overall_score": "20%",
    "notes": "While MOSIP includes privacy-by-design principles and risk assessment capabilities, it does not provide formal GDPR-compliant DPIA policies or systematic processes. Organizations using MOSIP must develop their own DPIA frameworks.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "P.PIA.D4",
    "title": "P.PIA.D4 Privacy risk register present",
    "overall_score": "75%",
    "notes": "MOSIP includes privacy-by-design principles, security framework, and risk management capabilities. However, it does not provide a formal GDPR-compliant privacy risk register as a systematic tool. Risk assessment is embedded in the security framework but not formalized as a dedicated privacy risk register with regular review processes.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "P.PIA.D5",
    "title": "P.PIA.D5 Applicability of the guidance document",
    "overall_score": "75%",
    "notes": "MOSIP provides comprehensive documentation including implementation guides and security guidelines. However, it does not have formal systematic processes for determining guidance document applicability or regulatory context mapping. The documentation is primarily technical implementation guidance rather than regulatory compliance guidance.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.PIA.D6",
    "title": "P.PIA.D6 Commencement of PIA at the design stage",
    "overall_score": "75%",
    "notes": "MOSIP implements privacy-by-design principles and privacy risk considerations throughout its development lifecycle. However, it does not provide formal PIA processes or systematic documentation for design-stage privacy impact assessments. Privacy considerations are embedded in the architecture but not formalized as distinct PIA processes.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "P.PIA.O2",
    "title": "P.PIA.O2 Privacy risk register periodically updated",
    "overall_score": "50%",
    "notes": "MOSIP has monitoring capabilities, audit trails, and risk assessment frameworks embedded in its security architecture. However, it does not maintain a formal privacy risk register that requires periodic updates. Privacy risk management is integrated into the overall security framework rather than maintained as a separate systematic register.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.PIA.O3",
    "title": "P.PIA.O3 Evidence of progress in the implementation / deployment of privacy controls",
    "overall_score": "75%",
    "notes": "MOSIP provides comprehensive audit capabilities, documentation tracking, and privacy control implementation evidence through its security and governance frameworks. However, it does not provide dedicated privacy training programs or awareness initiatives as part of the platform. Such training would need to be implemented by deploying organizations.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.PIA.O4",
    "title": "P.PIA.O4 Track progress when reducing privacy risks with flexible in-depth reporting",
    "overall_score": "60%",
    "notes": "MOSIP has monitoring capabilities and audit frameworks that can provide technical operational reports. However, it does not have dedicated privacy risk reporting mechanisms or stakeholder-specific privacy dashboards. The platform provides infrastructure that could support such reporting but doesn't include built-in privacy risk tracking reports.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.PIA.O5",
    "title": "P.PIA.O5 Privacy risk mitigation accountability established",
    "overall_score": "60%",
    "notes": "MOSIP provides role-based access control and audit capabilities that support accountability structures. However, it does not establish formal privacy risk mitigation accountability frameworks, data protection officer roles, or training programs. These organizational responsibilities would need to be implemented by deploying organizations based on their regulatory requirements.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "P.PIA.O6",
    "title": "P.PIA.O6 Use of an automation engine to kick off additional assessments when triggered",
    "overall_score": "25%",
    "notes": "MOSIP has monitoring capabilities and audit trails that could support automation, and its cloud-native architecture provides scalability. However, it does not include automated privacy assessment engines or trigger-based privacy evaluations. Such capabilities would require custom development on top of the MOSIP platform.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.PRMP.D2",
    "title": "P.PRMP.D2 Register of intended processing activities",
    "overall_score": "75%",
    "notes": "MOSIP documents its data processing activities, data types, and purposes within its architecture and data management frameworks. However, it does not maintain a formal GDPR-compliant register of processing activities as a systematic tool. Organizations deploying MOSIP would need to create and maintain such a register based on MOSIP's capabilities.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.PRMP.D3",
    "title": "P.PRMP.D3 Provision for technical & operational privacy controls",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive technical privacy controls including multi-factor authentication, biometric access controls, role-based permissions, advanced encryption, cryptographic protection, data minimization practices, monitoring capabilities, and systematic privacy control frameworks.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.PRMP.D4",
    "title": "P.PRMP.D4 Privacy risk evaluation criteria established",
    "overall_score": "80%",
    "notes": "MOSIP provides strong technical privacy risk controls and security frameworks but lacks formal privacy risk evaluation criteria as a systematic methodology. Technical safeguards and risk-appropriate controls are implemented through the security framework, but systematic privacy-specific evaluation criteria are not formally defined.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.PRMP.D5",
    "title": "P.PRMP.D5 Privacy risk Impact criteria established",
    "overall_score": "85%",
    "notes": "MOSIP provides strong data classification capabilities, risk assessment frameworks, and technical privacy controls that support impact evaluation. However, formal privacy impact criteria as systematic methodologies for breach severity evaluation are not comprehensively documented as standalone procedures.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "P.PRMP.D6",
    "title": "P.PRMP.D6 Privacy Risk acceptance criteria established",
    "overall_score": "75%",
    "notes": "MOSIP provides risk management frameworks, security standards integration, and governance structures that support privacy risk management. However, formal privacy risk acceptance criteria as systematic organizational baseline methodologies are not explicitly defined as standalone procedures.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "P.PRMP.O1",
    "title": "P.PRMP.O1 Privacy risk mitigation accountability established",
    "overall_score": "100%",
    "notes": "MOSIP provides basic governance structures and role-based access control. However, specific data protection officer roles and comprehensive privacy training programs are not explicitly documented and would require implementation by deploying organizations.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.PRMP.O5",
    "title": "P.PRMP.O5 Vendor 3rd party privacy risk assessment conducted",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive third-party vendor privacy risk assessment with systematic PIAs, standardized evaluation frameworks (ISO 27001, NIST), audit and compliance verification, and continuous monitoring for all vendor relationships.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.PS.D1",
    "title": "P.PS.D1 Provision for a PIM  as part of the DID System",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive Privacy Information Management through privacy frameworks, resident services for individual control, secure authentication mechanisms, integrated privacy risk management, and detailed audit capabilities within the decentralized identity system.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.PS.O1",
    "title": "P.PS.O1 Conformance with ISO 27701",
    "overall_score": "80%",
    "notes": "MOSIP provides strong technical privacy capabilities and security controls that align with ISO 27701 requirements, but lacks formal PIMS establishment, systematic privacy management processes, and continuous improvement frameworks as required by the standard.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "P.PS.O2",
    "title": "P.PS.O2 Conformance with ISO GDPR",
    "overall_score": "90%",
    "notes": "MOSIP implements strong technical GDPR compliance including privacy-by-design, consent mechanisms, individual data rights support, and comprehensive audit capabilities. Lacks formal privacy impact assessment processes and comprehensive compliance documentation frameworks required by GDPR organizational requirements.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "P.PS.O4",
    "title": "P.PS.O4 Conformance with ISO 27550",
    "overall_score": "60%",
    "notes": "MOSIP provides strong technical privacy risk assessment capabilities and comprehensive audit trails. However, lacks formal systematic data protection impact assessment processes and ISO 27550-compliant DPIA frameworks as required by the standard. Technical privacy controls are robust but organizational DPIA processes are not formalized.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.PS.O5",
    "title": "P.PS.O5 Conformance with ISO 29101",
    "overall_score": "100%",
    "notes": "MOSIP demonstrates excellent ISO 29101 compliance with comprehensive privacy-enhancing technologies including cryptographic protection, secure authentication, privacy-preserving architecture, and detailed audit capabilities that effectively balance privacy protection with system functionality.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.RIP.D1",
    "title": "P.RIP.D1 Provision for Combined Remote identity proofing methods",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive combined remote identity proofing with multi-factor authentication, advanced biometric verification, knowledge-based authentication, and NIST SP 800-63-3 compliance for secure remote identity verification.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.RIP.D2",
    "title": "P.RIP.D2 Provision for non-predictable registration officers' pool",
    "overall_score": "80%",
    "notes": "MOSIP provides strong security, audit capabilities, and standards compliance for registration processes. However, lacks formal non-predictable registration officer pool mechanisms with random selection algorithms. Strong technical controls for information security and officer activity monitoring.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.RIP.D3",
    "title": "P.RIP.D3 Confirmation that the presented identity information is valid",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive identity information validation with knowledge-based authentication, biometric verification, document authenticity checking, digital verification capabilities, and detailed audit trails for all validation processes.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.RIP.D4",
    "title": "P.RIP.D4 Confirmation that a valid identity is associated with the correct individual",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive identity-to-individual association verification with multi-factor authentication, biometric matching, document verification, cross-reference validation, and detailed audit capabilities to prevent identity fraud and ensure accurate identity ownership confirmation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.RIP.D5",
    "title": "P.RIP.D5 provision for baseline attributes required to obtain the highest possible percentage of coverage",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive baseline attribute collection with biometric services, privacy-compliant data collection, multi-channel verification capabilities, and detailed audit trails to maximize identity verification coverage while protecting privacy.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.RIP.D6",
    "title": "P.RIP.D6 Obligations and rights of participants documented",
    "overall_score": "80%",
    "notes": "MOSIP provides strong individual data protection rights documentation and informed consent processes. However, lacks comprehensive formal documentation of participant obligations, organizational compliance requirements, and systematic participant communication frameworks for rights and obligations.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.RIP.O3",
    "title": "P.RIP.O3 Evidence of periodic vetting of operators",
    "overall_score": "60%",
    "notes": "MOSIP provides strong security policies and standards compliance but lacks formal systematic periodic operator vetting processes, background verification procedures, and regular assessment schedules as required for comprehensive operator vetting programs.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.RIP.O4",
    "title": "P.RIP.O4 Baseline assessment for the validity of identity proofs",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive baseline assessment capabilities with document verification, authenticity checking, cross-reference validation, biometric verification, and detailed audit trails for all identity proof validation activities.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.RIP.O5",
    "title": "P.RIP.O5 Validation of the existence of claimed identity overall period of time",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive identity existence validation with third-party verification, public record checking, background verification, biometric validation, temporal consistency checking, and detailed audit capabilities throughout the verification period.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.SU.D1",
    "title": "P.SU.D1 Provision for secondary use service (SUS)",
    "overall_score": "50%",
    "notes": "MOSIP is primarily a digital identity platform focused on ID lifecycle management. While it has consent management, audit trails, and data protection measures, it does not provide dedicated secondary use services for repurposing personal data as described. Secondary data usage would require additional implementation on top of MOSIP's base platform.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.SU.D3",
    "title": "P.SU.D3 Agreement(s) on how cross-organisation information flow is enforced",
    "overall_score": "75%",
    "notes": "MOSIP provides partner management capabilities and APIs for integration with external organizations but is primarily designed as a national identity platform rather than a cross-organizational data sharing system. While it includes security controls and audit capabilities, comprehensive cross-organizational consent management requires additional implementation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.SU.D4",
    "title": "P.SU.D4 Provision for a record management system",
    "overall_score": "75%",
    "notes": "MOSIP has identity data repository, audit logging, and lifecycle management capabilities that support record management functions for identity data. However, it is not a general-purpose enterprise record management system. Its record capabilities are focused on identity credentials and related audit data rather than comprehensive organizational records.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.SU.O2",
    "title": "P.SU.O2 Flow control restrictions for internal and external traffic to the The Distributed Incident Management System (DIMS)",
    "overall_score": "60%",
    "notes": "MOSIP is a digital identity platform, not a distributed incident management system. While MOSIP has network security controls, encryption, and audit capabilities, it does not implement a DIMS system as described.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.SU.O3",
    "title": "P.SU.O3 Designated policy enforcement Point(s)",
    "overall_score": "75%",
    "notes": "MOSIP has API Gateway and Keycloak-based access controls that perform policy enforcement functions, but it does not implement dedicated XACML-style PEP architecture. The system uses service-level controls and JWT token validation rather than formal PEP components.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.SU.O4",
    "title": "P.SU.O4 Automatic verification of write permissions for information between different domains",
    "overall_score": "75%",
    "notes": "MOSIP implements comprehensive access controls, authentication, and encryption capabilities. However, as a unified identity platform, it does not specifically operate in a multi-domain architecture requiring cross-domain write permission verification. The platform provides API-level access controls and audit logging for data operations.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.TIP.D3",
    "title": "P.TIP.D3 Provision for referential identity graphs",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive referential identity graphs with unique identifier management, automated data linking, standardized protocols, and identity data mapping across multiple systems using UIN, VID, and integration frameworks.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.TIP.D4",
    "title": "P.TIP.D4 Provision for an in-build record management system",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive integrated record management with centralized storage, automated workflows, compliance features for secure data handling, and integration capabilities for identity-related records and documents.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.TIP.O2",
    "title": "P.TIP.O2 Log data correlation",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive log data correlation with multi-source log aggregation, pattern identification, security threat detection, automated analysis, and integrated logging capabilities across all systems.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.UC.D1",
    "title": "P.UC.D1 User consent has been obtained",
    "overall_score": "100%",
    "notes": "MOSIP implements consent mechanisms through its registration process ensuring explicit user consent is obtained before collecting personal or biometric data during enrollment. However, comprehensive consent withdrawal and modification capabilities through resident services may require additional implementation depending on deployment.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.UC.D2",
    "title": "P.UC.D2 Data processing has been declared",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive data processing declarations with clear purposes, legal basis, accessibility, and systematic updates ensuring transparent declaration of all processing activities.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.UC.D3",
    "title": "P.UC.D3 Provision for the types of processing that require a DPIA",
    "overall_score": "60%",
    "notes": "MOSIP provides strong technical privacy capabilities for biometric processing, new technologies, and automated decision-making. However, lacks formal systematic DPIA processes for identifying and assessing processing activities that require privacy impact assessments as specified by GDPR.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.UC.D4",
    "title": "P.UC.D4 Provision for Dispute resolution",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive dispute resolution with grievance management, clear procedures, fair processes, documentation tracking, and timely communication through resident services and case management capabilities.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.UC.D5",
    "title": "P.UC.D5 Training provision for manual verification",
    "overall_score": "80%",
    "notes": "MOSIP provides strong standardized procedures, quality assurance measures, and comprehensive documentation for manual verification activities. However, lacks formal systematic training programs and competency assessments for verification personnel as described in the metric.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "P.UC.D6",
    "title": "P.UC.D6 Criteria for issuing data retention notice",
    "overall_score": "100%",
    "notes": "MOSIP establishes comprehensive criteria for data retention notices with legal requirements integration, law enforcement support, business needs consideration, and systematic review processes through its data lifecycle management framework.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.UC.D7",
    "title": "P.UC.D7 Requirements for secure data disposal",
    "overall_score": "75%",
    "notes": "MOSIP implements secure data disposal through its data lifecycle management with automated deletion, retention policies, and audit trails. The platform provides software-based secure deletion mechanisms but does not directly handle physical hardware destruction, which requires separate infrastructure-level procedures.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.UC.D8",
    "title": "P.UC.D8 Provision for DRR procedures",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive disaster recovery and resilience procedures with automated backup systems, high availability architecture, redundancy, failover capabilities, regular testing, and systematic disaster response protocols.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.UC.O1",
    "title": "P.UC.O1 Periodic assessment for regulatory conformance of consent policies",
    "overall_score": "80%",
    "notes": "MOSIP provides strong regulatory review, gap analysis, remediation capabilities, and ongoing monitoring. However, lacks formal systematic periodic assessment processes for consent policy regulatory conformance as described in the organizational metric.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.UC.O2",
    "title": "P.UC.O2 Consent as a precondition of a service",
    "overall_score": "100%",
    "notes": "MOSIP implements appropriate consent mechanisms with voluntary practices, essential service access without unnecessary consent requirements, clear consent categorization, meaningful user choice, and ethical consent validity verification.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.UC.O3",
    "title": "P.UC.O3 Compliance with the Regulation of Investigatory Powers Act 2000 (RIPA)",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive compliance mechanisms with legal frameworks, oversight systems, lawful interception capabilities, privacy safeguards, and detailed audit trails ensuring RIPA compliance while maintaining civil liberties protections.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.UC.O4",
    "title": "P.UC.O4 Dispute management system deployed & operationalised",
    "overall_score": "75%",
    "notes": "MOSIP provides basic complaint management capabilities through its Resident Services module with case tracking and status updates. The platform includes audit capabilities for tracking complaint resolution but lacks comprehensive dispute management features like formal mediation processes or structured dispute resolution frameworks.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.UC.O5",
    "title": "P.UC.O5 Automated validation and verification of documentation",
    "overall_score": "100%",
    "notes": "MOSIP implements automated validation and verification through its Registration Processor with comprehensive document processing, data extraction, validation rules, and system integration capabilities. The platform provides digital signature verification and supports integration with external business systems for consistent data management.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.UC.O7",
    "title": "P.UC.O7 Right to be informed has been enforced",
    "overall_score": "100%",
    "notes": "MOSIP enforces the right to be informed with comprehensive privacy framework, clear information provision, transparent communication, updated policies, and accessible mechanisms for individuals to understand data processing activities.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.UL.D1",
    "title": "P.UL.D1 DUL statements per consent group defined",
    "overall_score": "80%",
    "notes": "MOSIP provides strong privacy framework and consent management capabilities with accessible documentation. However, lacks formal systematic Data Use Limitation (DUL) statement definitions for specific consent groups as described in the metric. The platform focuses more on overall privacy controls than granular consent group-specific limitations.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.UL.D2",
    "title": "P.UL.D2 Purpose(s) for processing defined in privacy information",
    "overall_score": "100%",
    "notes": "MOSIP clearly defines processing purposes with legitimate legal basis, transparent communication, data minimization principles, and comprehensive compliance accountability for all identity processing activities.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.UL.O1",
    "title": "P.UL.O1 User data collection procedure compliant with documentation obligations to specify EIDMS's purpose(s)",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive user data collection procedures with documentation compliance, clear EIDMS purpose specification, consent management, data minimization principles, and data lifecycle management in accordance with GDPR and regulatory requirements.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.UL.O2",
    "title": "P.UL.O2 Monitoring of changes in data collection purpose(s)",
    "overall_score": "80%",
    "notes": "MOSIP provides strong audit capabilities, compliance checking, transparency, and user control mechanisms. However, lacks formal systematic monitoring of data collection purpose changes and automated purpose change detection as described in the metric.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.UL.O4",
    "title": "P.UL.O4 Consent for new purpose has been obtained",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive consent management with systematic collection, transparent communication, documentation, opt-in mechanisms, consent withdrawal capabilities, and data minimization principles for new processing purposes.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.WDPP.D1",
    "title": "P.WDPP.D1 Provision for a Privacy Risk Management Framework (PRF)",
    "overall_score": "80%",
    "notes": "MOSIP provides strong technical privacy risk assessment, mitigation measures, continuous monitoring, and compliance capabilities. However, lacks formal systematic Privacy Risk Management Framework (PRF) as an organizational structure with comprehensive training and communication programs.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.WDPP.D2",
    "title": "P.WDPP.D2 Privacy vision and mission statement",
    "overall_score": "100%",
    "notes": "MOSIP establishes comprehensive privacy vision and mission with clear privacy commitment, long-term goals, core privacy values, defined objectives, and alignment with legal requirements and industry best practices.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.WDPP.D3",
    "title": "P.WDPP.D3 Alignment of the PRF with ISO27001",
    "overall_score": "100%",
    "notes": "MOSIP aligns Privacy Risk Management Framework with ISO 27001 standards through comprehensive risk assessments, appropriate security controls, aligned policies and procedures, and continuous monitoring for both privacy and security measures.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.WDPP.O1",
    "title": "P.WDPP.O1 Legitimate interest assessment",
    "overall_score": "100%",
    "notes": "MOSIP provides privacy framework documentation and audit capabilities but does not specifically implement formal Legitimate Interest Assessment (LIA) processes as required by GDPR Article 6(1)(f). Deployment organizations would need to implement LIA procedures for legitimate interest processing.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.WDPP.O2",
    "title": "P.WDPP.O2 Data breach readiness assessment",
    "overall_score": "80%",
    "notes": "MOSIP provides strong incident response plans, data identification, and testing capabilities. However, lacks formal systematic data breach readiness assessment processes and comprehensive staff training programs as organizational requirements.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "P.WDPP.O3",
    "title": "P.WDPP.O3 International data transfer assessment",
    "overall_score": "80%",
    "notes": "MOSIP provides strong data identification, security safeguards, risk documentation, and compliance monitoring capabilities. However, lacks formal systematic international data transfer assessment processes as an organizational requirement for cross-border data protection evaluation.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.AL.D1",
    "title": "REL.AL.D1 Identification of CDD measures using risk-based approach(es)",
    "overall_score": "70%",
    "notes": "MOSIP implements technical risk-based authentication and identity verification with systematic risk assessment and appropriate CDD measures. However, lacks formal AML compliance documentation and regulatory frameworks required for financial CDD requirements. Provides comprehensive audit trails for identity verification activities.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.AL.D10",
    "title": "REL.AL.D10 Assurance levels for identity proofing",
    "overall_score": "95%",
    "notes": "MOSIP implements comprehensive tiered assurance levels with NIST alignment, integrated biometric and multi-factor authentication, risk-based assurance selection, documented decision trails, and flexible assurance management. Excellent technical implementation of identity proofing assurance frameworks.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.AL.D3",
    "title": "REL.AL.D3 Provision for standardised ID proofing requirements",
    "overall_score": "90%",
    "notes": "MOSIP implements comprehensive standardized identity proofing with international standards compliance (ISO 29115, NIST SP 800-63), multi-factor authentication, risk-based verification, documented procedures, and electronic identification support. Strong technical framework with well-defined verification standards.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.AL.D4",
    "title": "REL.AL.D4 Establish evidence collection requirements",
    "overall_score": "80%",
    "notes": "MOSIP provides comprehensive evidence collection through audit logging, forensic compliance (ISO 27037), chain of custody protocols, and automated evidence preservation. However, lacks formal legal testing procedures for evidence admissibility verification.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.AL.D5",
    "title": "REL.AL.D5 Provision for compliance with FATF49 policies and guidelines",
    "overall_score": "60%",
    "notes": "MOSIP provides identity verification capabilities suitable for customer due diligence, comprehensive record keeping through audit systems, and interoperability frameworks. However, lacks specific FATF49 compliance implementation, automated suspicious activity reporting, and formal AML/CTF risk-based approaches as MOSIP is primarily a digital identity platform rather than a financial services system.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.AL.D6",
    "title": "REL.AL.D6 Identification of CDD measures using risk-based approach(es)",
    "overall_score": "70%",
    "notes": "MOSIP implements risk-based identity verification with automated risk assessment, tiered verification procedures, documented processes, and comprehensive audit trails. However, designed primarily for digital identity rather than financial CDD compliance requirements.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.AL.D7",
    "title": "REL.AL.D7 Provision for managing liability and legal issues",
    "overall_score": "70%",
    "notes": "MOSIP provides comprehensive legal compliance frameworks, data breach response procedures, legal inquiry processing, and compliance audit trails. However, lacks integrated liability insurance and indemnification measures as these are typically organizational rather than technical implementations.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.AL.D8",
    "title": "REL.AL.D8 Legal structure in place for roles, rights and responsibilities",
    "overall_score": "90%",
    "notes": "MOSIP implements comprehensive legal structures with defined roles, documented data protection policies, role-based access controls, data subject rights procedures, and compliance monitoring. Strong technical framework with well-defined governance structures.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.AL.D9",
    "title": "REL.AL.D9 Provision for self-assessment",
    "overall_score": "80%",
    "notes": "MOSIP provides comprehensive self-assessment through compliance frameworks, automated monitoring tools, continuous compliance tracking, and documented assessment results. However, lacks formal benchmarking capabilities against industry standards - relies on implementation-specific configurations rather than built-in benchmarking tools.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "REL.AL.O1",
    "title": "REL.AL.O1 Evidence of assessing ID proofing at different IAL",
    "overall_score": "90%",
    "notes": "MOSIP maintains comprehensive evidence of IAL assessments with detailed audit logs, testing capabilities, compliance reporting, and continuous monitoring. Strong technical framework for identity proofing evidence management across different assurance levels.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.AL.O10",
    "title": "REL.AL.O10 Conformance with eIDAS",
    "overall_score": "85%",
    "notes": "MOSIP provides strong eIDAS conformance capabilities with technical security measures, assessment procedures, authentication compliance, and documentation. However, full eIDAS conformance requires formal EU accreditation processes that depend on implementation and jurisdictional context.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.AL.O11",
    "title": "REL.AL.O11 Conformance with ISO 29115",
    "overall_score": "90%",
    "notes": "MOSIP demonstrates comprehensive ISO 29115 conformance with systematic assurance level assessment, multi-entity authentication, risk assessment methodology, and compliance documentation. Excellent implementation of entity authentication assurance framework standards.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.AL.O2",
    "title": "REL.AL.O2 Auditing of resolution-validation-verification processes in ID proofing",
    "overall_score": "95%",
    "notes": "MOSIP implements comprehensive auditing of resolution-validation-verification processes with detailed audit trails, accuracy verification, trusted source validation, biometric authenticity auditing, and real-time monitoring. Excellent technical implementation of identity proofing process auditing.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.AL.O3",
    "title": "REL.AL.O3 Use of biometrically-enabled Machine Readable Travel Document (MRTD)",
    "overall_score": "85%",
    "notes": "MOSIP supports comprehensive MRTD integration with biometric verification, automated document processing, ICAO compliance, and secure biometric data handling. Strong technical capabilities for travel document integration, though specific MRTD implementations may require additional configuration.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.AL.O5",
    "title": "REL.AL.O5 Customer Due diligence (CDD) obligations imposed",
    "overall_score": "70%",
    "notes": "MOSIP provides comprehensive identity verification with mandatory proofing procedures, enhanced risk-based measures, and compliance monitoring. However, lacks specific AML/CTF alignment as MOSIP is primarily a digital identity platform rather than a financial services system requiring formal CDD obligations.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.AL.O6",
    "title": "REL.AL.O6 Transaction monitoring technology present",
    "overall_score": "80%",
    "notes": "MOSIP provides comprehensive transaction monitoring with audit tracking, analytics capabilities, pattern analysis, external data integration, and automated alerting. Strong technical foundation for monitoring identity transactions, though primarily focused on identity rather than financial transaction monitoring.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.AL.O7",
    "title": "REL.AL.O7 Conformance with ISO 29115",
    "overall_score": "90%",
    "notes": "MOSIP demonstrates strong ISO 29115 conformance with entity authentication assurance framework compliance, multi-level authentication capabilities, risk assessment methodology, and comprehensive compliance documentation. Excellent technical implementation of authentication assurance standards.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.AL.O8",
    "title": "REL.AL.O8 Conformance with ISO TS 29003",
    "overall_score": "90%",
    "notes": "MOSIP demonstrates strong ISO TS 29003 conformance with comprehensive identity proofing compliance, graduated verification processes, security technique implementation, and compliance documentation. Excellent technical implementation of identity proofing standards.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.AL.O9",
    "title": "REL.AL.O9 Conformance with ISO 24760 51",
    "overall_score": "90%",
    "notes": "MOSIP demonstrates strong ISO 24760 conformance with comprehensive identity management framework compliance, proper terminology implementation, privacy-preserving capabilities, attribute management, and compliance documentation. Excellent adherence to identity management standards.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.EAS.D2",
    "title": "REL.EAS.D2 Quality assurance program for internal audits",
    "overall_score": "85%",
    "notes": "MOSIP implements comprehensive quality assurance for internal audits with standardized procedures, automated audit trails, result validation, and continuous improvement mechanisms. Strong technical foundation for audit quality management with systematic audit process control.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.EAS.D3",
    "title": "REL.EAS.D3 Quality assurance program for external audits",
    "overall_score": "80%",
    "notes": "MOSIP provides comprehensive external audit quality assurance with standardized procedures, auditor access controls, result validation, and coordination mechanisms. Strong technical support for external audit activities, though formal external audit programs depend on organizational implementation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.EAS.O4",
    "title": "REL.EAS.O4 Ongoing monitoring of external audits",
    "overall_score": "85%",
    "notes": "MOSIP provides comprehensive ongoing monitoring of external audits with tracking capabilities, finding management, automated corrective action monitoring, progress reporting, and continuous improvement mechanisms. Strong technical support for external audit oversight and management.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.EAS.O5",
    "title": "REL.EAS.O5 Compliance with the audit plan(s)",
    "overall_score": "90%",
    "notes": "MOSIP maintains excellent compliance with audit plans through comprehensive plan adherence, consistent methodologies, automated tracking, scope-aligned findings, and deviation management. Strong technical foundation for systematic audit plan execution and compliance management.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.GA.D1",
    "title": "REL.GA.D1 Provision for Government approved audits",
    "overall_score": "80%",
    "notes": "MOSIP provides comprehensive government audit provisions with regulatory compliance frameworks, automated audit trails, security audit support, and government-suitable reporting. Strong technical foundation for audit compliance, though specific government approval processes vary by jurisdiction.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.GA.O1",
    "title": "REL.GA.O1 Conformance with ISO 17065",
    "overall_score": "75%",
    "notes": "MOSIP provides conformity assessment capabilities with compliance frameworks, certification processes, impartial assessment support, and documentation. However, lacks full accreditation body requirements implementation as MOSIP is primarily a digital identity platform rather than a certification body requiring formal CASCO committee compliance.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.HUT.D1",
    "title": "REL.HUT.D1 Provision for error-handling at runtime",
    "overall_score": "95%",
    "notes": "MOSIP implements excellent runtime error-handling with comprehensive exception management, integrated error detection, systematic prioritization and classification, automatic recovery mechanisms, and diagnostic capabilities. Strong technical foundation for runtime error management.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.HUT.D2",
    "title": "REL.HUT.D2 Provision for monitoring and logging DIMS application errors",
    "overall_score": "95%",
    "notes": "MOSIP implements excellent application error monitoring and logging with comprehensive tracking, real-time automated detection, severity-based classification, automated recovery procedures, and detailed analytics. Strong technical foundation for application error management.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.HUT.D3",
    "title": "REL.HUT.D3 Provision for unhandled exceptions logging",
    "overall_score": "95%",
    "notes": "MOSIP implements excellent unhandled exception logging with comprehensive capture mechanisms, automated real-time detection, severity-based classification, detailed stack trace capture, and automated alerting. Strong technical foundation for exception management and system stability.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.HUT.O1",
    "title": "REL.HUT.O1 Error-handling mechanisms deployed",
    "overall_score": "95%",
    "notes": "MOSIP deploys excellent error-handling mechanisms with comprehensive detection, controlled exception handling, detailed logging and reporting, proactive input validation, and graceful degradation capabilities. Strong technical foundation for system reliability and stability.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.SUS.D3",
    "title": "REL.SUS.D3 3rd parties adhere to CDD requirements",
    "overall_score": "75%",
    "notes": "MOSIP provides comprehensive partner management with CDD requirement frameworks, compliance monitoring, automated verification, and contractual obligations. However, lacks specialized continuous CDD enforcement as MOSIP focuses primarily on digital identity rather than financial CDD compliance monitoring.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "REL.SUS.O1",
    "title": "REL.SUS.O1 Customer Due diligence (CDD) obligations imposed",
    "overall_score": "70%",
    "notes": "MOSIP provides comprehensive identity verification with standardized procedures, risk-based approaches, and compliance monitoring across user contact points. However, lacks specialized automated CDD violation detection as MOSIP focuses primarily on digital identity rather than financial CDD obligations.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "REL.SUS.O2",
    "title": "REL.SUS.O2 Ongoing authentication of an onboarded customer/citizen",
    "overall_score": "95%",
    "notes": "MOSIP implements excellent ongoing authentication with comprehensive verification, multi-factor support, risk-based approaches, detailed logging and monitoring, and seamless user experience. Strong technical foundation for continuous identity verification and security.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "REL.SUS.O3",
    "title": "REL.SUS.O3 RBA47 present to using DID for citizen identification, verification & authentication",
    "overall_score": "85%",
    "notes": "MOSIP provides comprehensive risk-based authentication with DID support, decentralized identity capabilities, adaptive authentication levels, privacy controls, and interoperability. Strong technical foundation for DID-based identity management, though full DID implementation may require additional configuration and standards alignment.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.BD.D1",
    "title": "RES.BD.D1 Provision for BCR/DR Plan(s)",
    "overall_score": "80%",
    "notes": "MOSIP provides comprehensive technical infrastructure for BCR/DR with risk assessment integration, continuity planning through system architecture, documented recovery strategies, and backup procedures. However, lacks formal organizational BCR/DR testing and training programs as these require implementation-specific operational procedures beyond the technical platform.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "RES.BD.D2",
    "title": "RES.BD.D2 Provision for Business Impact Assessment (BIA)",
    "overall_score": "75%",
    "notes": "MOSIP provides technical foundation for BIA with critical function identification, risk assessment capabilities, and continuity planning integration. However, lacks formal organizational BIA testing and continuous improvement processes as these require implementation-specific business operations beyond the technical platform scope.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "RES.BD.D3",
    "title": "RES.BD.D3 Provision for alternate storage site",
    "overall_score": "90%",
    "notes": "MOSIP provides excellent alternate storage capabilities with comprehensive backup provisions, geographic distribution, adequate connectivity, security measures, and regular testing validation. Strong technical foundation for distributed data storage and disaster recovery with robust architectural support.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.BD.D4",
    "title": "RES.BD.D4 Alternate processing site",
    "overall_score": "90%",
    "notes": "MOSIP provides excellent alternate processing capabilities with comprehensive continuity sites, tiered standby options, geographic separation, adequate infrastructure, and regular testing procedures. Strong architectural foundation for processing redundancy and business continuity.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.BD.D5",
    "title": "RES.BD.D5 Provision for information system backup",
    "overall_score": "95%",
    "notes": "MOSIP provides excellent information system backup with comprehensive data protection, multiple backup types, secure encrypted storage, automated processes with monitoring, and regular testing validation. Strong technical foundation for data backup and recovery operations.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.BD.D6",
    "title": "RES.BD.D6 Provision for alternative security mechanisms",
    "overall_score": "90%",
    "notes": "MOSIP provides comprehensive security frameworks including multi-factor authentication, audit management, network monitoring, and advanced security mechanisms. Strong architectural foundation for alternative security controls beyond traditional measures.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.BD.D7",
    "title": "RES.BD.D7 Provision for alternate communication protocols",
    "overall_score": "90%",
    "notes": "MOSIP provides comprehensive secure communication protocols including SSL/TLS, secure messaging, and integration frameworks. Strong foundation for alternate communication protocols with security and reliability features.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.BD.O10",
    "title": "RES.BD.O10 % of mission-critical cyber resources which are recovered from a backup",
    "overall_score": "80%",
    "notes": "MOSIP provides comprehensive backup frameworks, business continuity architecture, and data management capabilities with strong redundancy. While technical backup capabilities are excellent, comprehensive organizational backup recovery testing requires additional disaster recovery validation procedures.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.BD.O11",
    "title": "RES.BD.O11 % of cyber resources for which additional monitoring is applied during and after the recovery process",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive monitoring frameworks through audit manager and security systems with excellent capabilities for vulnerability scanning, network monitoring, and compliance tracking during recovery processes.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.BD.O3",
    "title": "RES.BD.O3 Contingency plans tested",
    "overall_score": "60%",
    "notes": "MOSIP provides strong technical testing framework and quality assurance, but formal organizational contingency plan testing (tabletop exercises, disaster drills) requires additional organizational disaster recovery testing processes beyond platform capabilities.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.BD.O4",
    "title": "RES.BD.O4 Results of Recovery plans tested",
    "overall_score": "65%",
    "notes": "MOSIP provides excellent technical testing and quality assurance frameworks, but comprehensive organizational disaster recovery testing (full-scale simulations, disaster scenarios) requires additional formal organizational disaster recovery testing procedures beyond platform testing capabilities.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.BD.O5",
    "title": "RES.BD.O5 Maximum Tolerable Period of Disruption ( MTPoD) defined",
    "overall_score": "40%",
    "notes": "MOSIP provides strong technical recovery planning and architecture foundations, but formal organizational MTPoD definition and BIA processes require additional business continuity planning procedures beyond platform capabilities.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "RES.BD.O6",
    "title": "RES.BD.O6 Predictable failure prevention",
    "overall_score": "75%",
    "notes": "MOSIP provides excellent monitoring, maintenance, performance analysis, and redundancy capabilities for predictable failure prevention. Strong technical foundation, though comprehensive organizational training programs require additional processes beyond platform capabilities.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "RES.BD.O8",
    "title": "RES.BD.O8 Percentage of mission-critical and system control data for which provenance can be validated",
    "overall_score": "85%",
    "notes": "MOSIP provides comprehensive data management, governance, and audit frameworks with strong data tracking, access controls, and audit logging capabilities. Excellent foundation for data provenance validation across mission-critical and system control data.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.BPDC.D1",
    "title": "RES.BPDC.D1 Provision for assets inventory",
    "overall_score": "40%",
    "notes": "MOSIP provides technical monitoring and audit capabilities but comprehensive asset inventory management requires additional organizational processes beyond platform scope.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.BPDC.D2",
    "title": "RES.BPDC.D2 Provision for service access monitoring",
    "overall_score": "100%",
    "notes": "MOSIP provides excellent access monitoring capabilities through its audit manager and authentication services. Strong logging, tracking, and incident detection capabilities for comprehensive service access monitoring.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.BPDC.D3",
    "title": "RES.BPDC.D3 Is the system capable of specifying Static & Dynamic SoD rules?",
    "overall_score": "40%",
    "notes": "MOSIP provides basic monitoring capabilities but comprehensive SoD rule specification requires additional organizational controls.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.BPDC.O1",
    "title": "RES.BPDC.O1 % of cyber assets to which access is controlled based on criticality",
    "overall_score": "80%",
    "notes": "MOSIP provides strong access control and authentication services with RBAC and data protection capabilities.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.BPDC.O2",
    "title": "RES.BPDC.O2 False Positive Reporting Rate (FPRR)",
    "overall_score": "60%",
    "notes": "MOSIP provides audit and monitoring frameworks but specific FPRR optimization requires additional security operations tools.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.BPDC.O3",
    "title": "RES.BPDC.O3 Static SoD rules applied",
    "overall_score": "40%",
    "notes": "MOSIP provides role-based access control and basic governance frameworks. However, specific static SoD rules for job function separation and systematic conflict prevention are not clearly documented in available MOSIP resources.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "RES.BPDC.O4",
    "title": "RES.BPDC.O4 Dynamic SoD rules applied",
    "overall_score": "20%",
    "notes": "MOSIP provides audit logging and monitoring capabilities. However, specific dynamic SoD rules with real-time conflict detection and behavioral analysis are not documented in available MOSIP resources.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "RES.BPDC.O5",
    "title": "RES.BPDC.O5 Frequency of service access monitoring",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive audit logging and monitoring through its audit manager module. The system supports continuous access tracking, authentication event monitoring, and real-time event correlation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.CR.D1",
    "title": "RES.CR.D1 Criticality analysis",
    "overall_score": "85%",
    "notes": "MOSIP implements comprehensive criticality analysis with systematic asset evaluation, classification by operational importance, disruption impact assessment, and prioritized protection strategies. Strong risk management foundation with regular analysis updates for critical asset protection.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.CR.D3",
    "title": "RES.CR.D3 Define mission assurance plans",
    "overall_score": "70%",
    "notes": "MOSIP provides strong technical frameworks for risk management, business continuity, and partner management. However, comprehensive organizational mission assurance planning including human capital strategies requires additional organizational strategic planning processes beyond platform capabilities.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.CR.O6",
    "title": "RES.CR.O6 % of cyber resources for which access control is maintained throughout the recovery process",
    "overall_score": "100%",
    "notes": "MOSIP maintains comprehensive access control through security framework and audit manager with continuous monitoring during recovery processes.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.IDR.D2",
    "title": "RES.IDR.D2 Provision for minimum password policy age",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive authentication framework with password policy management and identity recovery support.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.IDR.D3",
    "title": "RES.IDR.D3 Provision for Maximum password age policy",
    "overall_score": "100%",
    "notes": "MOSIP provides authentication services with configurable password policies and security requirements.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.IDR.D4",
    "title": "RES.IDR.D4 Provision for Minimum password length policy",
    "overall_score": "85%",
    "notes": "",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.IDR.D5",
    "title": "RES.IDR.D5 Provision for a password audit policy",
    "overall_score": "90%",
    "notes": "",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.IDR.D6",
    "title": "RES.IDR.D6 Provision for automated password recovery",
    "overall_score": "60%",
    "notes": "MOSIP provides authentication services and supports multi-factor authentication. However, specific automated password recovery features and compliance with NIST 800-63B for password recovery are not clearly documented in available resources.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "RES.IDR.O1",
    "title": "RES.IDR.O1 Enforce password history policy",
    "overall_score": "80%",
    "notes": "MOSIP provides strong authentication framework with password management capabilities. Excellent foundation for password history enforcement with security and identity recovery support.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.IDR.O2",
    "title": "RES.IDR.O2 Enforce minimum password policy age",
    "overall_score": "60%",
    "notes": "MOSIP provides authentication services with password management capabilities. However, specific minimum password age enforcement and related policy controls are not clearly documented in available resources.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "RES.IDR.O3",
    "title": "RES.IDR.O3 Enforce Maximum password age policy",
    "overall_score": "60%",
    "notes": "MOSIP provides authentication services with user management capabilities. However, specific maximum password age enforcement and NIST compliance for password lifetimes are not clearly documented in available resources.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.IDR.O4",
    "title": "RES.IDR.O4 Enforce Minimum password length policy",
    "overall_score": "80%",
    "notes": "MOSIP provides authentication services with password validation capabilities including minimum length enforcement. The system supports NIST-aligned password requirements and prevents weak password creation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "RES.IDR.O5",
    "title": "RES.IDR.O5 Enforced password audit policy",
    "overall_score": "80%",
    "notes": "MOSIP provides comprehensive audit logging through its audit manager module with automated monitoring capabilities. However, specific regulatory compliance for password audit requirements is not clearly documented.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.IDR.O6",
    "title": "RES.IDR.O6 Automated password recovery deployed",
    "overall_score": "60%",
    "notes": "MOSIP provides authentication services and supports multi-factor authentication methods. However, specific compliance with NIST 800-63B, ISO 27001, and PCI DSS for password recovery is not clearly documented in available resources.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "RES.IFP.D1",
    "title": "RES.IFP.D1 Separate deployment profiles of patches",
    "overall_score": "100%",
    "notes": "MOSIP implements excellent patch management with separate deployment profiles, criticality-based deployment, thorough testing procedures, staged approaches, and automated management capabilities. Strong technical foundation for secure and systematic patch deployment.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.IFP.D2",
    "title": "RES.IFP.D2 Rigorous preparation of patch deployment",
    "overall_score": "90%",
    "notes": "",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.IFP.D3",
    "title": "RES.IFP.D3 Regular time-windows for patches",
    "overall_score": "85%",
    "notes": "",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.IFP.D4",
    "title": "RES.IFP.D4 Provision for a patching severity and tracking system in place",
    "overall_score": "60%",
    "notes": "MOSIP provides basic patch management capabilities but comprehensive vulnerability severity assessment requires additional security management tools.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.IFP.D5",
    "title": "RES.IFP.D5 Security control catalogue",
    "overall_score": "80%",
    "notes": "MOSIP provides comprehensive security documentation and frameworks with organized security controls and implementation guidance. However, specific evidence of regular threat-based updates to the security control catalogue is not clearly documented.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.RS.D1",
    "title": "RES.RS.D1 Provision for incident response control(s)",
    "overall_score": "85%",
    "notes": "MOSIP provides comprehensive security monitoring, audit management, and incident detection capabilities. Strong technical foundation for incident response with security frameworks and business continuity architecture.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.RS.D2",
    "title": "RES.RS.D2 Provision for IR Plan(s)",
    "overall_score": "80%",
    "notes": "MOSIP provides comprehensive incident response frameworks with audit management, business continuity, and security protocols. Strong technical foundation, though formal organizational IR plan testing requires additional organizational incident response procedures.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.RS.O1",
    "title": "RES.RS.O1 Incident reporting controls deployed",
    "overall_score": "80%",
    "notes": "MOSIP provides comprehensive incident management framework through audit manager with automated reporting, monitoring integration, and response capabilities. Strong foundation for incident reporting controls.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.RS.O2",
    "title": "RES.RS.O2 Incident response policy and procedures tested",
    "overall_score": "60%",
    "notes": "MOSIP provides governance frameworks and audit capabilities for documentation and continuous improvement. However, specific incident response testing procedures and tabletop exercises are not clearly documented in available resources.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.RS.O4",
    "title": "RES.RS.O4 Incident monitoring deployed",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive audit and monitoring capabilities through its audit manager module. The system supports real-time monitoring, detection, and alerting for security incidents across the platform.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.RS.O6",
    "title": "RES.RS.O6 Incident Response Plan tested",
    "overall_score": "60%",
    "notes": "MOSIP provides governance frameworks and continuous improvement capabilities. However, specific incident response plan testing procedures and realistic security incident simulations are not clearly documented in available resources.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.SPE.D1",
    "title": "RES.SPE.D1 Plan of actions and milestones",
    "overall_score": "80%",
    "notes": "MOSIP provides technical framework for incident response and audit management but formal organizational POAM processes require additional procedures.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.SPE.D2",
    "title": "RES.SPE.D2 Establish cyber resilience design principles",
    "overall_score": "85%",
    "notes": "MOSIP demonstrates strong architectural framework with defense-in-depth security, redundancy mechanisms, and comprehensive testing capabilities. Excellent foundation for cyber resilience design principles.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.SPE.D3",
    "title": "RES.SPE.D3 Provision for an information security architecture",
    "overall_score": "85%",
    "notes": "MOSIP provides comprehensive security architecture with integrated policies, risk management, and compliance components. While documentation frameworks exist, organizational training and awareness programs require additional HR and training processes beyond platform capabilities.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RES.SPE.D4",
    "title": "RES.SPE.D4 Provision for a tool to monitor third-party security",
    "overall_score": "40%",
    "notes": "MOSIP provides governance frameworks and security testing capabilities. However, specific third-party security monitoring tools and vendor risk management platforms are not clearly documented in available MOSIP resources.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "RES.SPE.O3",
    "title": "RES.SPE.O3  Compliance with contractual SLAs",
    "overall_score": "75%",
    "notes": "MOSIP provides excellent performance monitoring, audit management, and incident response capabilities. While technical monitoring is strong, contractual SLA compliance requires additional organizational service management processes beyond platform capabilities.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RO.EMR.D2",
    "title": "RO.EMR.D2 Policy retirement programme in place",
    "overall_score": "100%",
    "notes": "MOSIP maintains version-controlled documentation with deprecation processes through release management and includes compliance evaluation processes through its compliance framework. However, MOSIP does not have a dedicated formal policy retirement program specifically focused on organizational policy retirement.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RO.EMR.D4",
    "title": "RO.EMR.D4 Provision for RAM test strategies",
    "overall_score": "100%",
    "notes": "MOSIP includes stress testing methodologies in its testing framework with load testing scenarios that validate memory usage under high-load conditions. The platform implements performance monitoring through integration with monitoring solutions like Prometheus and Grafana for tracking memory usage patterns.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RO.EMR.O1",
    "title": "RO.EMR.O1 Tracking of entitlements via granted policies",
    "overall_score": "100%",
    "notes": "MOSIP implements role-based access control through its identity and access management system with well-defined roles for different user types. The platform maintains detailed audit trails for all access control decisions and supports attribute-based policies for granular entitlement management.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RO.EMR.O2",
    "title": "RO.EMR.O2 Tracking of entitlements via manual requests",
    "overall_score": "100%",
    "notes": "MOSIP implements request tracking through its workflow management system that handles manual requests for special access with detailed tracking and approval processes. The platform includes structured approval workflows through administrative interfaces with systematic review and multi-level authorization requirements.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RO.EMR.O3",
    "title": "RO.EMR.O3 Maintainability demonstration(s)",
    "overall_score": "100%",
    "notes": "MOSIP defines maintainability requirements through its architecture documentation and deployment guides with clear metrics for system maintenance. The platform implements microservices architecture with containerized deployment enabling easy component maintenance, updates, and replacement.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RO.EO.D1",
    "title": "RO.EO.D1 Provision for managing improper input validation",
    "overall_score": "100%",
    "notes": "MOSIP implements input validation through its API framework with systematic validation of input parameters, data types, and formats across system interfaces. The platform includes security testing with regular vulnerability assessments and supports deployment with web application firewalls and intrusion detection systems.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RO.EO.O1",
    "title": "RO.EO.O1 Improper neutralisation",
    "overall_score": "100%",
    "notes": "MOSIP implements input neutralization through its security framework with systematic sanitization across APIs and web interfaces. The platform includes regular security assessments and supports integration with automated security tools like WAFs and IDS for comprehensive neutralization protection.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RO.EO.O2",
    "title": "RO.EO.O2 Operationalisation of an input validation framework",
    "overall_score": "100%",
    "notes": "MOSIP implements input validation framework through its API specifications and security guidelines with well-defined standards for data types and validation rules. The platform provides systematic validation controls across all interfaces and includes comprehensive error handling through its audit framework.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RO.PD.D1",
    "title": "RO.PD.D1 Plan(s) for an enterprise-class provisioning engine",
    "overall_score": "100%",
    "notes": "MOSIP implements workflow automation through its registration processor and ID lifecycle management with automated provisioning workflows for identity creation, updates, and deactivation. The platform includes resident services and pre-registration system enabling users to request services and manage their identity information.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RO.PD.D2",
    "title": "RO.PD.D2 Provision for data access request services (DARS)",
    "overall_score": "100%",
    "notes": "MOSIP implements request management through its resident services with tracking of data access requests and status updates. The platform provides identity verification through multi-factor authentication and biometric verification to ensure only authorized individuals can access their personal data.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RO.PD.D3",
    "title": "RO.PD.D3 Provision for correlation of services / data",
    "overall_score": "100%",
    "notes": "MOSIP implements data aggregation through its data processing pipeline and integration framework enabling collection from multiple registration sources and partner systems. The platform provides standardized data formats through API specifications and includes analytical capabilities for pattern recognition and deduplication analysis.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RO.PD.D4",
    "title": "RO.PD.D4 Provision for aggregation of services / data",
    "overall_score": "100%",
    "notes": "MOSIP implements aggregation capabilities through its microservices architecture and service integration framework enabling aggregation of services and data from multiple sources. The platform provides standardized interfaces through its API framework and supports both real-time and batch aggregation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RO.TPV.D2",
    "title": "RO.TPV.D2 Provision for a storage monitoring system",
    "overall_score": "100%",
    "notes": "MOSIP implements storage monitoring through integration with monitoring solutions like Prometheus and Grafana that track storage metrics including IOPS, throughput, latency, and capacity utilization. The platform supports automated alerting for storage issues and provides compatibility with various storage infrastructure types.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RO.TPV.O3",
    "title": "RO.TPV.O3 Monitoring IOPS",
    "overall_score": "100%",
    "notes": "MOSIP implements IOPS monitoring through integration with performance monitoring tools that track read/write operations per second across storage systems. The platform supports I/O optimization through its scalable architecture and deployment on modern infrastructure with distributed storage techniques.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "RO.TPV.O4",
    "title": "RO.TPV.O4 Monitoring I/O Splitting",
    "overall_score": "100%",
    "notes": "MOSIP implements I/O monitoring through its performance monitoring framework that tracks I/O splitting patterns and distribution across multiple storage devices. The platform supports optimal I/O distribution through its scalable deployment architecture with distributed storage systems and load balancing techniques.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.AAA.D2",
    "title": "S.AAA.D2 Provision for policy enforcement using standard protocols",
    "overall_score": "100%",
    "notes": "MOSIP enforces security policies via standard protocols including OAuth 2.0 tokens but does not use a dedicated XACML-based policy framework. MOSIP does not deploy standalone Policy Decision Point or Policy Information Point components, however, it uses Keycloak module that validates all communication among microservices.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.AAA.D3",
    "title": "S.AAA.D3 System capable of combining policy rules of different policies",
    "overall_score": "33%",
    "notes": "MOSIP allows importing per-partner policies in the Policy Management Service. However, MOSIP does not offer any built-in conflict-detection or resolution mechanism for policies. Each microservice simply enforces the policy it has been given, with no global conflict-resolution logic. MOSIP's Policy Management Service does not include any facility to assign numeric priorities or precedence among distinct policy bundles for automatic conflict reconciliation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.AAA.D4",
    "title": "S.AAA.D4 AC system capable of combining different policy models",
    "overall_score": "100%",
    "notes": "MOSIP supports multiple access control models including Role-based access control, Group-based access control, Attribute-based access control, Time-based access control, and JavaScript-based custom logic. MOSIP Keycloak issues a JWT at login combining the results of whatever policies are defined at that moment, and each MOSIP service validates that token. Keycloak validates all communication among microservices. MOSIP Keycloak allows the creation of custom policies and providers via its Service-Provider Interface, including custom Policy Information Points for attribute lookup or entirely new policy evaluators.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.AAA.D5",
    "title": "S.AAA.D5 AC functions to convert, import, or export external AC policies",
    "overall_score": "33%",
    "notes": "MOSIP supports custom JSON documents for policy management. However, MOSIP does not provide automatic conversion between different access control models. The system does not maintain version history or allow rollback to prior imports, nor does it store information about the origin of policies.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.AAA.D6",
    "title": "S.AAA.D6 Provision to enforce the least privilege principle (PoLP)",
    "overall_score": "0%",
    "notes": "MOSIP Keycloak uses tokens which seem to only contain roles and not attributes, hence permissions appear to be only available at the resource and scope level. MOSIP does not offer built-in segregation of duties enforcement. MOSIP services trust only JWT claims issued at login with no runtime attribute lookup, so MOSIP cannot dynamically scope data queries by attributes at the policy layer. MOSIP does not include an integrated privilege-request and approval workflow.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.AAA.D7",
    "title": "S.AAA.D7 System capable of specifying Static SoD rules",
    "overall_score": "0%",
    "notes": "MOSIP and its Keycloak integration do not support declarative static segregation of duties rules at any granularity including global, per-application, or per-data domain levels. MOSIP cannot grant scoped exceptions that automatically expire; any such override would require a custom Keycloak Service Provider Interface extension or external process.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.AAA.D8",
    "title": "S.AAA.D8 Dynamic SoD rules",
    "overall_score": "0%",
    "notes": "MOSIP does not include a dynamic segregation of duties engine. The system cannot write dynamic rules that combine attributes, actions, and context for real-time conflict detection. MOSIP has no built-in mechanism to quarantine changes or gate them behind secondary approval when segregation of duties conflicts occur.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.AC.D1",
    "title": "S.AC.D1 Provision for Deterrent Controls",
    "overall_score": "33%",
    "notes": "MOSIP provides security error messages through its authentication components when unauthorized access attempts occur, including validation errors and authentication failures. The system provides logging capabilities through its audit framework and basic health monitoring. However, MOSIP lacks prominent security warnings specifically designed to deter malicious attempts and does not implement comprehensive account lockout or systematic rate limiting mechanisms across authentication endpoints to deter brute force attacks.",
    "questions": [
      {
        "status": "partial"
      },
      {
        "status": "partial"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.AC.D10",
    "title": "S.AC.D10 Provision for session termination",
    "overall_score": "75%",
    "notes": "MOSIP provides session termination capabilities through its authentication services and Keycloak integration allowing users to log out. The system implements automatic session timeouts through Keycloak configuration with configurable timeout periods. MOSIP administrators can terminate sessions through Keycloak's administrative interface for security management. While MOSIP handles token invalidation, comprehensive documentation on complete session data clearing across all components is limited.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.AC.D2",
    "title": "S.AC.D2 Provision for Preventative Controls",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive access controls through Keycloak integration with role-based and attribute-based access control mechanisms. The system includes input validation across its APIs and services following secure coding practices. MOSIP implements encryption for data in transit using TLS/HTTPS and for data at rest using cryptographic modules including HSM integration. The deployment architecture includes network security controls and segmentation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.AC.D3",
    "title": "S.AC.D3 Provision for Detective Controls",
    "overall_score": "75%",
    "notes": "MOSIP implements comprehensive audit logging that captures all system activities, user actions, and security events. The system supports integration with intrusion detection systems and includes monitoring capabilities for detecting suspicious activities. MOSIP provides real-time monitoring with alerting capabilities for security events. However, while MOSIP follows secure development practices, it does not include built-in automated vulnerability scanning capabilities, though external scanning tools can be integrated.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.AC.D4",
    "title": "S.AC.D4 Provision for Corrective Controls",
    "overall_score": "50%",
    "notes": "MOSIP provides security guidelines and incident response capabilities, though specific documented procedures may vary by deployment. The system includes backup and recovery mechanisms as part of its deployment architecture. While MOSIP has comprehensive audit logging, it does not provide built-in forensic analysis tools, though logs can be used for external forensic investigation. MOSIP does not include built-in automated patch management, requiring manual updates and deployment processes.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.AC.D5",
    "title": "S.AC.D5 Provision for policy enforcement / decision / Information Points",
    "overall_score": "67%",
    "notes": "MOSIP implements Policy Enforcement Points through its API Gateway and service-level access controls that intercept and validate requests. The system uses Keycloak as a centralized policy decision point for authentication and authorization decisions. While MOSIP has attribute retrieval capabilities, it does not implement a dedicated Policy Information Point architecture as described in XACML standards, relying more on JWT token-based attributes.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.AC.D6",
    "title": "S.AC.D6 Is the AC enforced by a client/server communication protocol?",
    "overall_score": "67%",
    "notes": "MOSIP uses standard protocols including OAuth 2.0 and JWT for access control communication between components. The system does not use XACML or SAML for access control communication, primarily relying on JWT tokens and REST API communications. MOSIP supports federated access control through OpenID Connect and OAuth 2.0 integration capabilities.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.AC.D8",
    "title": "S.AC.D8 Does the AC system support host-based rules?",
    "overall_score": "33%",
    "notes": "MOSIP can enforce some host-based rules through its authentication service which can validate requests based on IP restrictions and device characteristics. However, while MOSIP has some device-based capabilities, it does not have comprehensive host-based policy enforcement that varies significantly based on connecting device characteristics. MOSIP does not provide built-in host blacklisting/whitelisting capabilities, though such controls could be implemented at the infrastructure level.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.AC.O1",
    "title": "S.AC.O1 Deployment of Deterrent Controls",
    "overall_score": "75%",
    "notes": "MOSIP deploys visible security measures including rate limiting, audit logging, and authentication controls that serve as deterrents. The system can be configured to display security warnings and notices through its web interfaces and API responses. MOSIP implements comprehensive audit and monitoring capabilities that create deterrent effects for malicious activities. While MOSIP has comprehensive audit capabilities, the visibility of these audit trails to end users as a deterrent mechanism may be limited depending on configuration.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.AC.O2",
    "title": "S.AC.O2 Deployment of Preventive Controls",
    "overall_score": "100%",
    "notes": "MOSIP has comprehensive preventive controls deployed including role-based access control, authentication mechanisms, and API security. The system implements input validation across its API specifications and follows secure coding practices to prevent common attacks. MOSIP deploys encryption controls including cryptographic services, TLS for transit, and HSM integration for sensitive data. The deployment includes network security controls and segmentation as documented in deployment architectures.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.AC.O3",
    "title": "S.AC.O3 Deployment of Detective Controls",
    "overall_score": "75%",
    "notes": "MOSIP has deployed detective controls including comprehensive audit logging and monitoring systems. The system provides operational log monitoring through its audit manager and can integrate with external log analysis systems. MOSIP supports integration with intrusion detection systems and includes monitoring capabilities for detecting suspicious activities. While MOSIP has monitoring capabilities, fully automated threat detection and alerting may require additional integration with security tools.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.AC.O4",
    "title": "S.AC.O4 Deployment of Corrective Controls",
    "overall_score": "50%",
    "notes": "MOSIP provides corrective controls through its security guidelines and deployment best practices for incident response. The system includes deployed backup and recovery mechanisms as part of operational deployments. MOSIP requires manual patch management processes and does not include automated vulnerability management tools in standard deployments. While MOSIP provides comprehensive audit logs, dedicated forensic analysis tools are not part of the standard deployment.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.AC.O5",
    "title": "S.AC.O5 Information Flow enforcement has been deployed.",
    "overall_score": "50%",
    "notes": "MOSIP implements information flow controls through its modular architecture with clear separation between different service domains. The system uses API Gateway and service mesh architecture to control information flow between components. MOSIP does not implement traditional mandatory access control systems but relies more on role-based access control and API-level controls. While MOSIP has access controls, it does not implement formal data classification and cross-level leakage prevention mechanisms.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.AC.O6",
    "title": "S.AC.O6 Does the response time of granting an access request meet the organization's requirement?",
    "overall_score": "75%",
    "notes": "MOSIP provides real-time access control decisions through its authentication services and Keycloak integration with sub-second response times. The architecture is designed for high performance with load balancing and optimized service architectures. MOSIP can be configured to meet various SLA requirements through proper deployment and scaling configurations. While MOSIP has monitoring capabilities, specific response time monitoring for access control decisions may require additional configuration.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.AC.O7",
    "title": "S.AC.O7 Does the response time for the maximum number of access requests in an expected timeframe meet the organization's requirement?",
    "overall_score": "50%",
    "notes": "MOSIP is designed to handle high volumes through its scalable microservices architecture and can be deployed with load balancing. While MOSIP can be scaled for high loads, specific SLA guarantees during peak conditions depend on deployment configuration and may require load testing validation. MOSIP includes monitoring capabilities that can track system performance including response times. Standard MOSIP documentation does not include specific load testing results for maximum access request volumes, though the architecture supports horizontal scaling.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.AC.O8",
    "title": "S.AC.O8 Does the response time for activating and revoking AC rules meet the organization's requirement?",
    "overall_score": "67%",
    "notes": "MOSIP can activate access control rules in near real-time through Keycloak administration and policy updates. The system supports immediate access revocation through Keycloak's administrative interfaces and token invalidation mechanisms. While MOSIP has the capability for automated processes, standard implementations may require manual administrative actions for rule changes. MOSIP's architecture supports meeting typical organizational SLA requirements for access rule modifications through its administrative interfaces.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.CP.D1",
    "title": "S.CP.D1 Provision for an encryption and key (E&K) management policy programme",
    "overall_score": "75%",
    "notes": "MOSIP has comprehensive cryptographic services documentation that includes key management policies and procedures. The system provides detailed key lifecycle management through its cryptographic services including key generation, rotation, and revocation procedures. MOSIP specifies encryption algorithms and key strength requirements in its security specifications and cryptographic implementations. While MOSIP has robust key management, specific key escrow policies for business continuity scenarios are not explicitly detailed in the standard documentation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.CP.D2",
    "title": "S.CP.D2 Provision to record and communicate cryptographic, encryption and key management technology changes",
    "overall_score": "50%",
    "notes": "MOSIP has version control and documentation procedures for its cryptographic services and maintains change documentation. The system includes security guidelines and deployment procedures that consider the impact of cryptographic changes. However, while MOSIP has documentation, specific communication processes for notifying stakeholders of cryptographic changes are not explicitly detailed. MOSIP documentation does not include specific training and support procedures for stakeholders when cryptographic technologies are updated.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.CP.D4",
    "title": "S.CP.D4 Provision for cryptographic protection to data at-rest and in-transit",
    "overall_score": "100%",
    "notes": "MOSIP provides cryptographic protection for data at rest including database encryption and secure storage mechanisms. The system implements TLS/HTTPS for all communications and provides secure transit protection. MOSIP uses industry-standard cryptographic algorithms and appropriate key strengths as specified in its cryptographic specifications. MOSIP supports Hardware Security Module integration for enhanced protection of cryptographic keys and sensitive operations.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.CP.O6",
    "title": "S.CP.O6 % of security-critical systems or system elements (e.g., cryptographic components) for which integrity / behavior can be validated",
    "overall_score": "75%",
    "notes": "MOSIP provides validation capabilities for cryptographic components through its testing frameworks and verification procedures. The system includes automated validation through its audit capabilities and integrity checking mechanisms. MOSIP provides comprehensive coverage for security validation across its modular architecture and security-critical components. While MOSIP has validation capabilities, comprehensive documentation of validation coverage percentages and actionable results may require additional implementation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.CP.O7",
    "title": "S.CP.O7 % of external communications which are encrypted",
    "overall_score": "100%",
    "notes": "MOSIP enforces TLS/HTTPS for all external communications as documented in its security architecture and API specifications. The system requires encrypted communications for all partner integrations and external system interfaces. MOSIP includes monitoring capabilities that can verify and track encryption usage across communications. The MOSIP architecture mandates encryption for all external communications with no unencrypted external interfaces as per its security design principles.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.CP.O8",
    "title": "S.CP.O8 % of internal communications which are encrypted",
    "overall_score": "100%",
    "notes": "MOSIP enforces encryption for all internal service communications through its microservices architecture using TLS and secure protocols. The system encrypts all database communications and internal API calls as documented in its security specifications. MOSIP ensures that all administrative and management communications are encrypted through its security architecture and deployment guidelines. The MOSIP architecture mandates encryption for all internal communications with comprehensive coverage across all system components and interfaces.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.CP.O9",
    "title": "S.CP.O9 % of transactions in the IDMS are digitally signed",
    "overall_score": "75%",
    "notes": "MOSIP digitally signs enrollment and registration transactions as part of its identity lifecycle management and data integrity procedures. The system digitally signs authentication transactions through its authentication services to ensure transaction integrity. MOSIP signs administrative transactions through its audit logging and administrative interfaces with digital signatures. While MOSIP has extensive digital signing capabilities, achieving 100% coverage across all possible transaction types may require additional configuration and validation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.DD.D1",
    "title": "S.DD.D1 Provision for Incident Response procedures",
    "overall_score": "50%",
    "notes": "MOSIP provides security guidelines and incident response capabilities within its security framework. The system includes logging and audit capabilities that support incident classification and analysis. However, while MOSIP has security documentation, specific incident response team roles and responsibilities are not clearly defined in the standard documentation. MOSIP documentation does not include specific procedures for post-incident review and continuous improvement processes.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.DD.D2",
    "title": "S.DD.D2 Provision for physical security aspects",
    "overall_score": "25%",
    "notes": "MOSIP includes deployment guidelines that address infrastructure security considerations including physical aspects. However, while MOSIP mentions infrastructure security, specific physical access control requirements for premises are not detailed in the standard documentation. MOSIP documentation does not include specific guidelines for physical security of hardware components beyond general deployment practices. The system does not include specific requirements for environmental monitoring and physical infrastructure protection.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.DD.D3",
    "title": "S.DD.D3 Provision for escalation procedures",
    "overall_score": "25%",
    "notes": "MOSIP includes monitoring capabilities that can support incident escalation through alerting mechanisms. However, while MOSIP has monitoring, specific escalation paths and contact procedures for different security events are not detailed in standard documentation. MOSIP monitoring can generate alerts but does not include built-in automated escalation mechanisms beyond basic alerting. The documentation does not include specific procedures for regular review and update of escalation procedures.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.DD.O1",
    "title": "S.DD.O1 Incident Response plan tested",
    "overall_score": "25%",
    "notes": "MOSIP documentation does not include specific guidance for regular incident response testing or exercises. While MOSIP has security capabilities, there is no mention of tabletop exercises or incident simulations in the standard documentation. MOSIP does not include a defined schedule for incident response plan testing and updates. However, MOSIP's comprehensive audit logging can support documentation and analysis of security events, though not specifically for incident response plan testing.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.DD.O2",
    "title": "S.DD.O2 Communication and escalation procedures tested",
    "overall_score": "25%",
    "notes": "MOSIP documentation does not include specific guidance for testing communication and escalation procedures through regular exercises. While MOSIP has monitoring capabilities, testing of communication channels is not specifically addressed. MOSIP does not include specific testing procedures for escalation processes across different incident severity levels. However, MOSIP's audit capabilities can support analysis and improvement processes, though not specifically for communication testing.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.ELS.D1",
    "title": "S.ELS.D1 Provision for multi-vendor ID security solutions",
    "overall_score": "75%",
    "notes": "MOSIP supports integration with multiple vendors through its modular architecture and open APIs, allowing for multi-vendor implementations. The system provides standardized APIs and follows open standards for integration with third-party security solutions. MOSIP's architecture ensures interoperability through standard protocols like OAuth 2.0, JWT and REST APIs. While MOSIP has testing capabilities, specific validation frameworks for multi-vendor security solution integrations are not explicitly documented.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.ELS.D2",
    "title": "S.ELS.D2 Provision for multi-layer technical controls",
    "overall_score": "100%",
    "notes": "MOSIP implements multiple layers including authentication, Keycloak-based authorization, and session management. The deployment architecture includes multiple network security layers as documented in deployment guidelines. MOSIP implements multiple data protection layers including cryptographic services, TLS, and application-level controls. The system provides multiple monitoring layers through audit logging, monitoring systems, and integration capabilities.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.ESL.O1",
    "title": "S.ESL.O1 Presence of multi-vendor ID security solutions",
    "overall_score": "75%",
    "notes": "MOSIP supports multi-vendor deployments through its modular architecture and can integrate with various identity vendors and solutions. The system demonstrates interoperability through standard protocols and API integrations that work with multiple vendor solutions. MOSIP's production deployments can incorporate multiple vendor solutions working together through its standardized interfaces. While MOSIP supports multi-vendor integration, specific operational evidence or case studies of successful multi-vendor deployments are not extensively documented.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.ESL.O2",
    "title": "S.ESL.O2 Technical multi-layer controls deployed",
    "overall_score": "100%",
    "notes": "MOSIP has multiple technical security layers deployed including authentication, authorization, encryption, and monitoring as documented in security architecture. MOSIP demonstrates defense-in-depth with controls spanning network, application, data, and identity layers across its modular architecture. MOSIP deploys security controls across all layers including network security, application-level controls, and data protection mechanisms. MOSIP provides operational evidence through audit logging and monitoring capabilities that demonstrate multi-layer control effectiveness.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.FAM.D1",
    "title": "S.FAM.D1 System capable of specifying Static SoD rules",
    "overall_score": "25%",
    "notes": "MOSIP does not include built-in static SoD rule enforcement across federated domains, though basic role separation can be managed through Keycloak. MOSIP can prevent conflicting role assignments through Keycloak's role management capabilities within its domain. MOSIP does not provide built-in cross-federation SoD rule enforcement, requiring external policy management for complex federated scenarios. While MOSIP has role management, automatic SoD validation during provisioning is not a built-in feature of the standard system.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.FAM.D2",
    "title": "S.FAM.D2 System capable of specifying Dynamic SoD rules",
    "overall_score": "0%",
    "notes": "MOSIP does not include built-in dynamic SoD rule capabilities for federated access management scenarios. MOSIP does not provide real-time cross-federation SoD violation monitoring capabilities. MOSIP does not include behavioral analysis capabilities for detecting conflicts across federated identity providers. MOSIP does not include automated dynamic SoD alerting and response mechanisms for federated scenarios.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.FAM.D3",
    "title": "S.FAM.D3 Provision for an entitlement catalogue",
    "overall_score": "75%",
    "notes": "MOSIP provides entitlement management through Keycloak's role and permission management capabilities. MOSIP defines and documents entitlements through its role-based access control system and API specifications. MOSIP supports entitlement mapping across federated scenarios through Keycloak's federation capabilities and standard protocols. While MOSIP has audit capabilities, specific entitlement audit and review workflows may require additional implementation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.FAM.D4",
    "title": "S.FAM.D4 Provision to trace each business rule to all its related information",
    "overall_score": "50%",
    "notes": "MOSIP provides traceability through its audit logging and policy management capabilities that link rules to their implementation. While MOSIP has documentation, comprehensive traceability mapping between business rules and all related information may require additional implementation. MOSIP's modular architecture and API design support impact analysis through its well-defined service boundaries and interfaces. MOSIP provides audit data but specific compliance reporting for rule-to-information relationships may require custom development.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.FAM.O3",
    "title": "S.FAM.O3 Information Leakage protection",
    "overall_score": "75%",
    "notes": "MOSIP deploys information leakage protection through encryption, access controls, and secure communication protocols. MOSIP prevents unauthorized data exposure through secure federated protocols and privacy-preserving authentication mechanisms. MOSIP provides monitoring capabilities and audit logging that can detect potential information leakage. While MOSIP has privacy-preserving features, comprehensive data minimization enforcement across all federated scenarios may require additional configuration.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.FAM.O4",
    "title": "S.FAM.O4 Safety check(s) to prevent leaking of permissions",
    "overall_score": "75%",
    "notes": "MOSIP implements safety checks through secure authentication protocols and controlled permission sharing mechanisms. MOSIP validates permission boundaries through its API security and access control mechanisms before cross-domain operations. MOSIP includes automated validation through its access control framework and secure token mechanisms that limit permission exposure. While MOSIP has comprehensive audit capabilities, specific monitoring for permission leakage incidents may require additional configuration.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.IGI.D1",
    "title": "S.IGI.D1 Provision for compliance with industry connectors",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive APIs and standardized connectors for integration with various industry systems. MOSIP's architecture supports industry compliance through configurable security controls and data protection measures. MOSIP ensures data integrity and security through encrypted communications and secure API frameworks. MOSIP includes comprehensive audit and monitoring capabilities for tracking system integrations and compliance.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.IGI.D2",
    "title": "S.IGI.D2 Provision for groups that can create and monitor access review",
    "overall_score": "75%",
    "notes": "MOSIP provides role-based access control with administrative groups that can manage access reviews. MOSIP includes administrative interfaces and reporting tools for monitoring and reviewing user access. MOSIP follows documented processes for access management as outlined in its administration guides. While MOSIP supports role separation, specific segregation between provisioning and review functions requires implementation-specific configuration.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.IGI.D3",
    "title": "S.IGI.D3 Provision for an entitlement catalogue",
    "overall_score": "75%",
    "notes": "MOSIP maintains comprehensive role and permission management through its administrative framework. MOSIP's entitlement system covers detailed access rights across all platform components and services. MOSIP provides capabilities for regular review and updates of user roles and entitlements. While MOSIP supports automated processes, full integration with entitlement catalog requires additional configuration and implementation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.IGI.D5",
    "title": "S.IGI.D5 Provision for IDM policies",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive identity and access management policies as part of its core security framework. MOSIP's IDM framework covers complete identity lifecycle including registration, authentication, and credential management. MOSIP integrates access control with identity governance through its administrative framework. MOSIP's policies include compliance considerations and provision for regular reviews and updates.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.IGI.D6",
    "title": "S.IGI.D6 Catalogue of assets provisioned",
    "overall_score": "75%",
    "notes": "MOSIP maintains comprehensive documentation of all platform components and modules including services and data assets. MOSIP documentation includes detailed specifications for component ownership, security requirements, and data classifications. MOSIP's architecture supports asset lifecycle management through its modular deployment and configuration framework. While MOSIP supports asset management, full integration with automated security monitoring requires additional implementation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.IGI.D7",
    "title": "S.IGI.D7 Catalogue of controls provisioned",
    "overall_score": "100%",
    "notes": "MOSIP maintains comprehensive documentation of all security controls and measures implemented across the platform. MOSIP documentation includes detailed descriptions of security controls, implementation guidance, and effectiveness considerations. MOSIP's security framework maps controls to specific components, risks, and regulatory compliance requirements. MOSIP's documentation and security framework are regularly updated to reflect current control implementations and security measures.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.IGI.D8",
    "title": "S.IGI.D8 Provision for Segregation of Duties violation policy",
    "overall_score": "75%",
    "notes": "MOSIP implements role-based access control that supports segregation of duties principles. MOSIP provides role separation capabilities but automated SoD violation detection requires additional configuration and monitoring. MOSIP's access management framework supports integration of SoD policies through role definitions and access controls. MOSIP's administrative framework includes processes for investigating and resolving access control violations and security incidents.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.IGI.O1",
    "title": "S.IGI.O1 Periodic review of connectors and applications",
    "overall_score": "75%",
    "notes": "MOSIP supports periodic security reviews through its monitoring and administration capabilities. MOSIP's architecture supports vulnerability assessments and compliance monitoring for integrated components. MOSIP includes comprehensive logging and audit capabilities for tracking security reviews and remediation activities. While MOSIP supports review capabilities, formal scheduling and standardized review processes require implementation-specific configuration.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.IGI.O2",
    "title": "S.IGI.O2 Technical AC implemented",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive technical access controls including authentication, authorization, and encryption. MOSIP provides multi-factor authentication, role-based access control, and comprehensive encryption capabilities. MOSIP's access controls are automatically enforced through its technical architecture and security framework. MOSIP includes comprehensive audit and monitoring capabilities for all access control activities.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.IGI.O3",
    "title": "S.IGI.O3 Audit Connector present",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive audit and logging capabilities with centralized log collection. MOSIP's audit framework captures comprehensive security events including all authentication and authorization activities. MOSIP implements secure audit log protection and integrity measures through its security architecture. MOSIP's monitoring framework supports real-time audit analysis and security incident detection capabilities.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.MLP.D10",
    "title": "S.MLP.D10 Provision for maturity assessment in software design engineering",
    "overall_score": "100%",
    "notes": "MOSIP follows mature software development practices as documented in its development guidelines and architecture framework. MOSIP's development framework includes comprehensive security engineering, quality assurance, and lifecycle management practices. MOSIP continuously improves its development processes based on community feedback, security assessments, and best practices. MOSIP integrates development maturity with security control implementation through its comprehensive security and development framework.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.MLP.D11",
    "title": "S.MLP.D11 Provision for a controls’ gap analysis in alignment with the risk assessment  & IR strategy",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive security assessment frameworks that support gap analysis aligned with risk assessment and incident response. MOSIP's security framework includes detailed control specifications and improvement guidance for addressing security gaps. MOSIP integrates gap analysis with comprehensive risk management and incident response through its security architecture. MOSIP's development and security framework includes formal processes for prioritizing and implementing security improvements.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.MLP.D2",
    "title": "S.MLP.D2 Provision for a policy optimiser",
    "overall_score": "75%",
    "notes": "MOSIP provides configurable policy frameworks that support policy optimization and refinement. MOSIP includes comprehensive monitoring and analytics capabilities that can inform policy optimization decisions. MOSIP's architecture supports integration of threat intelligence and business requirements into policy decisions. While MOSIP supports policy configuration, fully automated policy optimization implementation requires additional development and integration.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.MLP.D3",
    "title": "S.MLP.D3 Provision for an ISMS",
    "overall_score": "100%",
    "notes": "MOSIP implements a comprehensive security management framework that aligns with ISMS principles and ISO 27001 standards. MOSIP's security framework includes comprehensive risk management, security controls, and performance monitoring capabilities. MOSIP provides detailed security documentation and policies with regular review processes. MOSIP's ISMS framework is designed for integration with organizational governance and regulatory compliance requirements.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.MLP.D4",
    "title": "S.MLP.D4 Provision for IDMS mission",
    "overall_score": "100%",
    "notes": "MOSIP has a clearly defined mission and vision for providing secure, inclusive, and interoperable identity management. MOSIP's mission aligns with comprehensive security objectives and supports diverse organizational and national identity requirements. MOSIP's mission is well-documented and communicated through comprehensive documentation and stakeholder engagement. MOSIP's mission and objectives are regularly reviewed and updated through its development roadmap and community engagement.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.MLP.D5",
    "title": "S.MLP.D5 Provision for critical services plan",
    "overall_score": "75%",
    "notes": "MOSIP provides deployment and operational guidance that includes considerations for maintaining critical identity services. MOSIP's architecture supports business continuity through its resilient design and operational procedures. MOSIP documentation includes identification of critical service dependencies and system requirements. While MOSIP provides continuity guidance, regular testing and updating of critical services plans requires organizational implementation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.MLP.D6",
    "title": "S.MLP.D6 Provision for Risk management strategy",
    "overall_score": "100%",
    "notes": "MOSIP implements a comprehensive security and risk management framework as part of its core architecture. MOSIP's risk management approach includes identification, assessment, mitigation, and ongoing monitoring of security risks. MOSIP integrates risk management with security controls, monitoring, and incident response capabilities. MOSIP's risk management framework is designed for regular review and updates to address evolving threats and requirements.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.MLP.D7",
    "title": "S.MLP.D7 Information system inventory",
    "overall_score": "100%",
    "notes": "MOSIP maintains comprehensive system documentation that includes detailed inventory of all platform components and systems. MOSIP's documentation includes detailed system ownership, boundaries, classifications, and security requirements for all components. MOSIP's architecture documentation includes third-party integrations and external system dependencies. MOSIP's system inventory directly informs security control implementation and security planning across the platform.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.MLP.D8",
    "title": "S.MLP.D8 Provision for testing training & monitoring",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive testing and security guidelines for evaluating control effectiveness. MOSIP includes extensive documentation and training materials to support security awareness and proper system operation. MOSIP implements comprehensive monitoring and audit capabilities for continuous security oversight. MOSIP's security framework coordinates testing, training, and monitoring activities through integrated documentation and operational procedures.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.MLP.D9",
    "title": "S.MLP.D9 Asset registration programme in place",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive asset documentation and system inventory as part of its platform framework. MOSIP's documentation includes asset categorization and classification based on security requirements and system criticality. MOSIP's architecture supports asset lifecycle management through comprehensive deployment and operational guidance. MOSIP integrates asset management with security controls and risk management through its comprehensive security framework.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.MLP.O1",
    "title": "S.MLP.O1 Periodic ARA conducted",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive access management capabilities that support periodic access rights assessments. MOSIP's role-based access control system enables identification and management of inappropriate access rights. MOSIP includes audit and documentation capabilities for tracking access rights assessments and remediation. MOSIP integrates access rights assessment with comprehensive user lifecycle management and security policy enforcement.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.MLP.O4",
    "title": "S.MLP.O4 Security function verification",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive security verification frameworks for evaluating control effectiveness. MOSIP includes extensive testing, assessment, and validation capabilities as part of its security framework. MOSIP's security framework includes documentation and improvement processes based on verification findings. MOSIP supports both independent and internal verification through comprehensive audit and assessment capabilities.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.MLP.O5",
    "title": "S.MLP.O5 Software & firmware integrity",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive security measures including code integrity and secure deployment practices. MOSIP uses secure coding practices, digital signatures, and integrity verification throughout its architecture. MOSIP implements comprehensive access controls to prevent unauthorized system modifications. MOSIP's security framework includes monitoring and verification capabilities for maintaining software and firmware integrity.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.MLP.O6",
    "title": "S.MLP.O6 Information input validation",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive input validation and security controls across all system interfaces. MOSIP uses secure coding practices including whitelisting, format validation, and malicious content detection. MOSIP's security architecture includes comprehensive protection against injection attacks and input-based vulnerabilities. MOSIP's security framework includes ongoing monitoring and updates to input validation based on security best practices and threat landscape.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.MLP.O7",
    "title": "S.MLP.O7 Identify over-provisioned application-based rules",
    "overall_score": "75%",
    "notes": "MOSIP provides access management capabilities that support identification and review of access privileges. MOSIP's role-based access control system enables analysis and management of user privileges and permissions. MOSIP's access control framework includes capabilities for monitoring and managing access privileges. While MOSIP supports access management, formal automated detection and remediation of over-provisioned rules requires additional configuration and implementation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.MLP.O8",
    "title": "S.MLP.O8 Security controls' Gap analysis conducted",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive security assessment capabilities for conducting gap analysis against established standards. MOSIP's security framework is designed to align with industry standards and regulatory compliance requirements. MOSIP includes comprehensive documentation and improvement processes for addressing security gaps. MOSIP's development and security framework includes formal processes for implementing security improvements and addressing identified gaps.ecurity controls’ Gap analysis conducted",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.PEP.D1",
    "title": "S.PEP.D1 Provision for PIA/DPIA",
    "overall_score": "75%",
    "notes": "MOSIP includes privacy considerations and privacy-by-design principles that support PIA/DPIA requirements. MOSIP documentation includes guidance on privacy considerations and when privacy assessments should be conducted for different use cases. MOSIP provides privacy frameworks and guidelines that can be used as templates for conducting privacy impact assessments. While MOSIP has privacy controls, specific integration of PIA/DPIA results into system controls may require additional implementation depending on deployment.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.PEP.D2",
    "title": "S.PEP.D2 Provision for data classification programme(s)",
    "overall_score": "75%",
    "notes": "MOSIP provides data classification capabilities through its data protection framework and sensitivity handling procedures. MOSIP defines different data sensitivity levels and handling requirements for various types of personal data as documented in its privacy specifications. MOSIP implements security controls based on data sensitivity, including encryption and access controls for different data classification levels. While MOSIP has classification capabilities, formal documentation and regular review processes for data classification decisions may require additional governance implementation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.PEP.D3",
    "title": "S.PEP.D3 Provision for DLP",
    "overall_score": "50%",
    "notes": "MOSIP does not include built-in DLP capabilities, though it implements access controls and encryption that provide some data protection. MOSIP implements access controls and security measures that help prevent unauthorized access to sensitive data. MOSIP provides monitoring capabilities and audit logging that can detect potential data security incidents. While MOSIP has data protection measures, formal DLP policy integration with data classification may require additional implementation.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.PEP.D4",
    "title": "S.PEP.D4 Provision for PET",
    "overall_score": "100%",
    "notes": "MOSIP incorporates multiple PETs including privacy-preserving biometric authentication and data minimization techniques. MOSIP implements privacy-preserving technologies including biometric template protection and secure data handling mechanisms. MOSIP uses advanced cryptographic protection and secure computation methods for privacy preservation. MOSIP integrates privacy-enhancing technologies throughout its architecture following privacy-by-design principles.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.PEP.O1",
    "title": "S.PEP.O1 PIA/DPIA executed",
    "overall_score": "50%",
    "notes": "MOSIP has undergone privacy assessments and considerations as part of its development and deployment processes. While MOSIP has privacy documentation, formal PIA/DPIA execution results may require additional organizational documentation. MOSIP has implemented privacy controls and measures based on privacy risk assessments and privacy-by-design principles. While MOSIP has privacy considerations, formal ongoing PIA/DPIA review processes may require additional governance implementation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.PEP.O2",
    "title": "S.PEP.O2 Data classification schemes applied",
    "overall_score": "75%",
    "notes": "MOSIP applies data classification schemes through its data protection framework and security architecture. MOSIP demonstrates proper handling of different data types through its layered security approach and privacy-preserving mechanisms. MOSIP applies appropriate security controls based on data sensitivity including encryption and access controls. While MOSIP has classification capabilities, regular monitoring and auditing of classification scheme compliance may require additional operational processes.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.PEP.O3",
    "title": "S.PEP.O3 DLP technology deployed",
    "overall_score": "50%",
    "notes": "MOSIP does not include built-in DLP technology as a core platform component. MOSIP provides protection for data at rest through encryption and in transit through secure protocols. MOSIP relies on access controls and permissions rather than dedicated DLP policy enforcement. MOSIP's security architecture supports incident response through logging and monitoring capabilities.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.PEP.O4",
    "title": "S.PEP.O4 PET deployed",
    "overall_score": "75%",
    "notes": "MOSIP implements privacy-enhancing technologies including data minimization and purpose limitation. MOSIP uses pseudonymization and tokenization techniques to protect personal identifiable information. MOSIP does not currently implement zero-knowledge proofs or homomorphic encryption as core features. MOSIP's privacy framework includes provisions for monitoring and validating privacy protection effectiveness.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RC.D1",
    "title": "S.RC.D1 Provision for internal audits",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive audit capabilities and frameworks for internal security assessments. MOSIP's audit framework covers all platform components, processes, and security controls comprehensively. MOSIP includes comprehensive audit logging and tracking capabilities for documenting and following up on audit findings. MOSIP's architecture supports scheduled auditing processes and provides the necessary tools and resources for effective audit execution.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RC.D2",
    "title": "S.RC.D2 Provision for external audit",
    "overall_score": "75%",
    "notes": "MOSIP provides comprehensive documentation and audit trails to support external audit requirements. MOSIP's architecture supports controlled external audit access through proper documentation and security controls. MOSIP includes capabilities for tracking and addressing external audit findings through its administrative framework. While MOSIP supports external audits, specific regulatory compliance may require additional configuration based on jurisdiction and requirements.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.RC.D3",
    "title": "S.RC.D3 Provision for certification and accreditation activities",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive documentation and assessment frameworks to support certification and accreditation processes. MOSIP's architecture is designed to support various industry certifications and compliance frameworks. MOSIP incorporates security and compliance requirements into its core architecture and operational frameworks. MOSIP includes comprehensive monitoring and audit capabilities to maintain certification and accreditation compliance.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RC.O1",
    "title": "S.RC.O1 Percentage of internal audits completed on-time",
    "overall_score": "75%",
    "notes": "MOSIP's audit and monitoring framework supports scheduled audit activities and tracking. MOSIP includes comprehensive reporting and monitoring capabilities for tracking audit activities and completion. MOSIP's audit framework includes capabilities for tracking and analyzing audit performance metrics. While MOSIP supports audit tracking, automated escalation for overdue audits requires additional configuration and implementation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.RC.O10",
    "title": "S.RC.O10 Conformance with ISO29115",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive authentication mechanisms with multiple assurance levels aligned with ISO29115. MOSIP provides configurable authentication assurance levels and multi-factor authentication capabilities consistent with ISO29115. MOSIP's authentication framework supports context-aware authentication and adaptive security measures. MOSIP includes comprehensive authentication monitoring and validation capabilities to ensure ongoing ISO29115 compliance.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RC.O11",
    "title": "S.RC.O11 Conformance with ISO29146",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive access management capabilities aligned with ISO29146 framework. MOSIP provides secure access management with comprehensive audit trails and accountability mechanisms. MOSIP's access management framework supports context-aware access controls and policy enforcement. MOSIP includes monitoring and audit capabilities necessary for maintaining ISO29146 compliance in access management.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RC.O12",
    "title": "S.RC.O12 Conformance with GDPR",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive data protection and privacy measures aligned with GDPR requirements. MOSIP provides capabilities to support GDPR individual rights including data access, correction, and deletion. MOSIP incorporates privacy by design and privacy by default principles throughout its architecture and operations. MOSIP includes frameworks for privacy impact assessments and ongoing GDPR compliance monitoring.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RC.O13",
    "title": "S.RC.O13 Conformance with ETSI EN 319411",
    "overall_score": "75%",
    "notes": "MOSIP provides comprehensive certificate management capabilities that can support qualified certificate requirements. MOSIP's PKI and certificate management framework aligns with trust service provider requirements. MOSIP includes comprehensive certificate lifecycle management capabilities including issuance, validation, and revocation. While MOSIP supports certificate management, specific ETSI EN 319411 compliance monitoring requires additional configuration and assessment processes.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.RC.O14",
    "title": "S.RC.O14 Conformance with ETSI EN 319521",
    "overall_score": "50%",
    "notes": "MOSIP provides digital signature capabilities and PKI infrastructure that can support electronic signature requirements. MOSIP does not include specific registered electronic mail service capabilities as a core platform feature. MOSIP includes digital signature management capabilities including creation, validation, and verification. While MOSIP supports digital signatures, specific ETSI EN 319521 compliance monitoring for electronic mail services requires additional implementation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.RC.O2",
    "title": "S.RC.O2 Percentage of external audits completed on-time",
    "overall_score": "75%",
    "notes": "MOSIP provides comprehensive documentation and support capabilities to facilitate timely external audit completion. MOSIP's architecture enables efficient information provision and response to external audit requirements. MOSIP includes monitoring capabilities that can track external audit progress and identify potential delays. While MOSIP supports external audit processes, proactive scheduling coordination requires organizational implementation beyond the platform capabilities.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.RC.O3",
    "title": "S.RC.O3 Is baseline access certification conducted?",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive access management and certification capabilities for verifying user privileges. MOSIP's role-based access control system ensures users receive only appropriate access based on their roles and responsibilities. MOSIP includes comprehensive audit and documentation capabilities for tracking access certification activities. MOSIP's administrative framework includes processes for correcting and managing inappropriate access assignments.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RC.O8",
    "title": "S.RC.O8 Conformance with ISO27001",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive security controls and management frameworks aligned with ISO27001 requirements. MOSIP provides comprehensive security documentation and policies that align with ISO27001 framework requirements. MOSIP's security architecture constitutes a comprehensive ISMS covering all platform components and operational processes. MOSIP includes audit and monitoring capabilities necessary for maintaining ISO27001 compliance and supporting certification processes.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RC.O9",
    "title": "S.RC.O9 Conformance with ISO24760",
    "overall_score": "100%",
    "notes": "MOSIP is designed as a comprehensive identity management platform that aligns with ISO24760 framework principles. MOSIP implements extensive privacy and security controls consistent with ISO24760 requirements. MOSIP provides comprehensive identity lifecycle management capabilities covering registration, authentication, and credential management. MOSIP's architecture and operational framework support ongoing compliance monitoring and maintenance of ISO24760 requirements.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RR.D1",
    "title": "S.RR.D1 Asset registration in place",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive asset management and documentation as part of its platform framework. MOSIP implements automated and secure data exchange capabilities through its comprehensive API and security framework. MOSIP integrates asset registration with comprehensive access controls and security measures. MOSIP's asset management framework supports ongoing maintenance and updates for effective risk management.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RR.D10",
    "title": "S.RR.D10 Provision for treatment controls",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive risk treatment controls as part of its security management framework. MOSIP's risk management approach includes comprehensive mitigation plans, monitoring, and evaluation capabilities. MOSIP includes regular evaluation and measurement of treatment control effectiveness through its security framework. MOSIP's framework supports ongoing adjustment and improvement of risk treatment controls based on evaluation findings.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RR.D2",
    "title": "S.RR.D2 Potential likelihood",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive risk assessment frameworks that include likelihood evaluation for security risks. MOSIP's risk management approach considers historical patterns, current security landscape, and emerging threat trends. MOSIP integrates likelihood assessments with impact analysis to provide comprehensive risk evaluation and prioritization. MOSIP's security framework includes regular review and updates of risk assessments based on evolving threat conditions.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RR.D4",
    "title": "S.RR.D4 Potential risk identified",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive risk identification processes as part of its security framework. MOSIP's risk identification covers comprehensive threat categories including cyber, operational, and compliance risks. MOSIP includes comprehensive risk documentation and assessment capabilities for evaluating potential threats. MOSIP's security framework includes systematic monitoring and updating of risk identification based on evolving threat landscape.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RR.D5",
    "title": "S.RR.D5 Accreditation / certification planned",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive documentation and frameworks to support accreditation and certification planning. MOSIP's architecture and documentation support various security standards, privacy requirements, and regulatory compliance frameworks. MOSIP integrates certification planning with comprehensive risk management and security control frameworks. MOSIP's framework includes ongoing preparation and maintenance capabilities to support certification and accreditation requirements.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RR.D6",
    "title": "S.RR.D6 Provision for Business Impact Assessment (BIA)",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive business continuity guidance and frameworks for assessing business impact. MOSIP's architecture includes considerations for business impact assessment and continuity of critical identity services. MOSIP's deployment and operational guidance supports business continuity and disaster recovery planning. MOSIP's framework supports regular updates and reviews of business impact assessments and continuity planning.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RR.D7",
    "title": "S.RR.D7 Provision for target protection levels",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive security classifications and protection levels based on asset importance and risk. MOSIP's security framework specifies appropriate controls and measures for different protection levels. MOSIP's security framework supports regular review and updates of protection levels based on evolving risks. MOSIP includes comprehensive monitoring and compliance capabilities to ensure protection levels are maintained.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RR.D8",
    "title": "S.RR.D8 Establish security objectives",
    "overall_score": "100%",
    "notes": "MOSIP establishes comprehensive security objectives as part of its security framework and architecture. MOSIP's security objectives are aligned with business requirements and comprehensive risk management approaches. MOSIP includes specific, measurable security objectives with regular review and assessment capabilities. MOSIP's framework includes clear accountability structures and ownership for security objective achievement.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RR.D9",
    "title": "S.RR.D9 Establish privacy objectives",
    "overall_score": "100%",
    "notes": "MOSIP establishes comprehensive privacy objectives as part of its data protection framework. MOSIP's privacy objectives align with regulatory compliance requirements and business objectives. MOSIP includes specific, measurable privacy objectives with regular assessment and compliance monitoring. MOSIP's framework includes clear governance and accountability structures for privacy objective achievement.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RR.O11",
    "title": "S.RR.O11 Conformance with ISO 15408",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive security evaluation frameworks that align with ISO 15408 evaluation criteria. MOSIP's security architecture includes defined security targets and evaluation approaches consistent with ISO 15408. MOSIP's security framework supports evaluation processes and documentation aligned with Common Criteria and ISO 15408. MOSIP includes ongoing monitoring and maintenance capabilities to support ISO 15408 compliance throughout the system lifecycle.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RR.O12",
    "title": "S.RR.O12 Conformance with ISO 27001",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive information security management aligned with ISO 27001 requirements. MOSIP's security framework includes comprehensive security controls consistent with ISO 27001 standards. MOSIP provides a formal information security management system framework following ISO 27001 principles. MOSIP includes audit and assessment capabilities necessary for maintaining ISO 27001 compliance and certification.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RR.O14",
    "title": "S.RR.O14 Conformance with ISO 17030",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive assessment frameworks that support third-party conformity assessment requirements. MOSIP's certification and compliance framework supports proper management of third-party conformity marks. MOSIP includes processes and documentation to support obtaining and maintaining third-party conformity certifications. MOSIP integrates conformity assessment requirements with comprehensive quality and security management frameworks.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RR.O15",
    "title": "S.RR.O15 Conformance with ITU-T X1208 (01/2014)",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive cybersecurity risk management that aligns with ITU-T X.1208 risk indicator principles. MOSIP's security framework includes cybersecurity indicators and metrics to enhance operational confidence and security. MOSIP supports risk-based security indicators and confidence measures consistent with ITU-T X.1208 guidelines. MOSIP includes monitoring and compliance capabilities that support ITU-T X.1208 requirements for telecommunication security.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RR.O2",
    "title": "S.RR.O2 Residual degradation",
    "overall_score": "75%",
    "notes": "MOSIP provides monitoring and maintenance capabilities to assess system component degradation. MOSIP's architecture supports lifecycle management and component renewal through its modular design. MOSIP's risk management framework can incorporate degradation risks into overall security and continuity planning. While MOSIP supports lifecycle management, proactive replacement planning requires organizational implementation and maintenance strategies.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.RR.O3",
    "title": "S.RR.O3 Residual impact",
    "overall_score": "100%",
    "notes": "MOSIP's risk management framework includes assessment and documentation of residual impacts after control implementation. MOSIP's comprehensive risk approach considers various impact scenarios including cybersecurity, operational, and continuity aspects. MOSIP integrates residual impact assessment with business continuity and incident response planning. MOSIP's framework supports ongoing monitoring and reassessment of residual impacts as security controls and threats evolve.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RR.O6",
    "title": "S.RR.O6 Accreditation / certification achieved",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive frameworks and documentation to support accreditation and certification achievement. MOSIP's architecture and documentation support various industry standards and regulatory certification requirements. MOSIP includes comprehensive monitoring and assessment capabilities to maintain certification compliance. MOSIP's framework supports formal processes for maintaining, renewing, and updating certification compliance.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RR.O7",
    "title": "S.RR.O7 Business Impact Assessment (BIA) conducted",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive guidance and frameworks for conducting business impact assessments for identity operations. MOSIP's architecture and documentation support identification of critical functions, dependencies, and recovery objectives. MOSIP's framework enables development and implementation of continuity and recovery plans based on BIA findings. MOSIP's framework supports regular review and updates of business impact assessments based on evolving requirements.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.RR.O8",
    "title": "S.RR.O8 Conformity checks in the absence of treatment controls",
    "overall_score": "75%",
    "notes": "MOSIP provides comprehensive compliance frameworks and capabilities for conducting conformity checks. MOSIP's assessment capabilities can identify compliance gaps and provide alternative approaches. MOSIP's flexible architecture supports alternative security measures and compensating controls. While MOSIP supports conformity checking, specific documentation and tracking of findings in the absence of treatment controls requires implementation-specific processes.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.SAA.D10",
    "title": "S.SAA.D10 Does the AC system provide policy identification for multiple policies?",
    "overall_score": "100%",
    "notes": "MOSIP includes multiple policy support with proper identification and management for different user groups and resources. MOSIP provides role-based policy configuration that allows different access control policies for various user roles and resource types. MOSIP includes policy selection mechanisms that allow appropriate policy identification during resource access. MOSIP integrates multiple policy support with comprehensive audit and monitoring capabilities for policy enforcement tracking.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.D11",
    "title": "S.SAA.D11 Does the AC system allow policy expiration assignment?",
    "overall_score": "100%",
    "notes": "MOSIP includes policy expiration capabilities that allow automatic revocation of access after specified time periods. MOSIP provides configurable expiration settings for different access control policies with specific dates and validity periods. MOSIP includes automated monitoring and enforcement mechanisms for policy expiration rules and access revocation. MOSIP provides comprehensive logging and audit capabilities for policy expiration events and compliance reporting.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.D12",
    "title": "S.SAA.D12 Provision to avoid policy rules conflict",
    "overall_score": "100%",
    "notes": "MOSIP includes policy validation mechanisms to detect and prevent conflicts between different access control rules. MOSIP implements clear policy frameworks that minimize overlap and contradiction between access control policies. MOSIP includes conflict resolution capabilities for managing overlapping or contradictory policy rules. MOSIP integrates policy conflict management with comprehensive audit and monitoring systems for effective policy governance.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.D2",
    "title": "S.SAA.D2 Potential degradation or Collateral Damage Potential (CDP)",
    "overall_score": "100%",
    "notes": "MOSIP includes detailed risk assessment frameworks and degradation analysis for system components and dependencies. MOSIP's microservices architecture includes isolation mechanisms to prevent cascading failures and collateral damage. MOSIP provides comprehensive backup and recovery procedures and disaster recovery planning to mitigate degradation risks. MOSIP implements layered security controls including network segmentation and service isolation to minimize collateral damage potential.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.D3",
    "title": "S.SAA.D3 Threat scenario potential or Impact Subscore Modifier (ISM)",
    "overall_score": "100%",
    "notes": "MOSIP includes detailed threat modeling and impact subscore analysis for confidentiality, integrity, and availability. MOSIP provides impact assessment frameworks with proper categorization of limited, serious, and catastrophic effects. MOSIP allows configuration of security impact levels based on organizational risk tolerance and deployment requirements. MOSIP integrates threat scenario analysis with comprehensive risk management and security planning frameworks.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.D4",
    "title": "S.SAA.D4 Vulnerability potential or Target Distribution (TD)",
    "overall_score": "100%",
    "notes": "MOSIP includes systematic vulnerability assessment and target distribution metrics for risk management. MOSIP provides monitoring capabilities to track and categorize vulnerability potentials as None, Low, Medium, or High. MOSIP includes vulnerability management workflows to minimize target distribution and reduce system exposure. MOSIP integrates target distribution analysis with comprehensive security risk frameworks and mitigation strategies.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.D5",
    "title": "S.SAA.D5 Provision for controls' testing",
    "overall_score": "100%",
    "notes": "MOSIP includes detailed security testing frameworks for comprehensive assessment of management, operational, and technical controls. MOSIP provides standardized testing procedures and documentation for security control assessment and validation. MOSIP includes continuous monitoring capabilities to assess and validate security control effectiveness. MOSIP integrates testing results with security management processes for continuous improvement and remediation.D5 Provision for controls’ testing",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.D7",
    "title": "S.SAA.D7 No of external security audits planned",
    "overall_score": "100%",
    "notes": "MOSIP includes detailed security audit frameworks that support external third-party security assessments. MOSIP provides audit planning guidelines that recommend regular external security audits as part of security management. MOSIP includes comprehensive audit trail capabilities and documentation to support external security audit requirements. MOSIP provides mechanisms to integrate external audit findings with security management processes for continuous improvement.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.D8",
    "title": "S.SAA.D8 Provision for AC log auditing",
    "overall_score": "100%",
    "notes": "MOSIP includes detailed AC log auditing procedures that collect and analyze system activities for security violations. MOSIP provides real-time monitoring and offline analysis capabilities for access control log auditing. MOSIP comprehensively logs third-party accesses and internal access control events for complete auditing. MOSIP integrates AC auditing with security monitoring and incident response procedures for comprehensive security management.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.D9",
    "title": "S.SAA.D9 Provision for customised audit information-providing capabilities",
    "overall_score": "100%",
    "notes": "MOSIP includes customizable audit reporting capabilities that can be tailored to specific organizational requirements. MOSIP provides configurable audit interfaces that can be customized for different stakeholder and compliance requirements. MOSIP includes flexible audit data access and query capabilities for custom analysis and reporting. MOSIP supports integration of customized audit capabilities with external systems and various compliance frameworks.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.O1",
    "title": "S.SAA.O1 Residual thread scenario or ISM",
    "overall_score": "100%",
    "notes": "MOSIP includes detailed threat modeling and residual risk assessment in its security framework. MOSIP categorizes CIA requirements and implements appropriate security controls for each category. MOSIP security documentation includes impact assessment methodologies and response procedures. MOSIP provides configurable security levels and risk tolerance frameworks for different deployment scenarios.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.O10",
    "title": "S.SAA.O10 False rejection rate (100%-FRR)",
    "overall_score": "100%",
    "notes": "MOSIP includes biometric authentication with configurable false rejection rate thresholds and quality optimization. MOSIP provides authentication analytics to monitor FRR metrics and optimize user authentication experience. MOSIP allows configuration of biometric matching parameters to balance false rejection rates with security requirements. MOSIP includes comprehensive monitoring and logging of authentication events to analyze and improve false rejection performance.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.O11",
    "title": "S.SAA.O11 Authorisation Rate (AR) %",
    "overall_score": "100%",
    "notes": "MOSIP includes detailed authorization tracking and metrics for measuring access control effectiveness. MOSIP provides analytics capabilities to analyze authorization patterns and optimize access control policies. MOSIP implements flexible role-based access control with configurable authorization policies and thresholds. MOSIP integrates authorization metrics with comprehensive security monitoring and incident response frameworks.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.O12",
    "title": "S.SAA.O12 Secure storage for accounting records",
    "overall_score": "100%",
    "notes": "MOSIP provides secure storage with encryption at rest and in transit for all accounting and audit records. MOSIP implements comprehensive role-based access control to restrict access to accounting records based on user roles and permissions. MOSIP includes audit trail protection and integrity verification mechanisms for accounting records. MOSIP implements comprehensive backup and recovery procedures for accounting records and audit data.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.O13",
    "title": "S.SAA.O13 Safety check capabilities to prevent leaking of permissions",
    "overall_score": "100%",
    "notes": "MOSIP includes comprehensive role-based access control with strict permission validation and safety checks. MOSIP provides audit capabilities for regular permission reviews and validation of access controls. MOSIP follows least privilege principles through granular access controls and role-based permission management. MOSIP includes comprehensive logging and monitoring of all permission changes and access control modifications.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.O14",
    "title": "S.SAA.O14 Response to audit processing failures",
    "overall_score": "100%",
    "notes": "MOSIP includes detailed incident response procedures for audit processing failures and system monitoring issues. MOSIP provides monitoring and alerting capabilities to detect and escalate audit processing failures. MOSIP includes troubleshooting procedures and root cause analysis capabilities for audit system failures. MOSIP provides comprehensive documentation and tracking of audit failure responses and corrective actions.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.O15",
    "title": "S.SAA.O15 Audit record retention",
    "overall_score": "100%",
    "notes": "MOSIP includes detailed audit record retention policies with configurable retention periods and compliance requirements. MOSIP provides secure storage for audit records with encryption and access controls to ensure integrity and confidentiality. MOSIP allows configuration of audit retention policies to meet various regulatory and organizational compliance requirements. MOSIP includes secure audit record disposal procedures that ensure proper data destruction when retention periods expire.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.O16",
    "title": "S.SAA.O16 Cross-organisation auditing supported",
    "overall_score": "100%",
    "notes": "MOSIP includes partner management and auditing capabilities that support cross-organization audit requirements. MOSIP provides audit trail access and reporting capabilities for external auditors and partner organizations. MOSIP includes standardized audit reporting and compliance interfaces for cross-organizational auditing requirements. MOSIP supports federated audit capabilities and cross-organizational compliance reporting for multi-partner environments.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.O2",
    "title": "S.SAA.O2 Residual vulnerability potential or TD",
    "overall_score": "100%",
    "notes": "MOSIP includes systematic vulnerability scanning, assessment, and remediation processes. MOSIP provides monitoring and metrics for system vulnerability distribution and exposure levels. MOSIP includes vulnerability management workflows and residual risk assessment procedures. MOSIP integrates vulnerability assessments with comprehensive security risk management frameworks.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.O4",
    "title": "S.SAA.O4 An ISMS is established",
    "overall_score": "100%",
    "notes": "MOSIP provides a complete ISMS framework aligned with ISO 27001 and NIST standards. MOSIP includes comprehensive security policies, procedures, and control frameworks. MOSIP provides mechanisms for ongoing security monitoring, assessment, and improvement. MOSIP includes integrated risk assessment and comprehensive incident management procedures.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.O5",
    "title": "S.SAA.O5 API to 3rd party authentication",
    "overall_score": "100%",
    "notes": "MOSIP provides comprehensive APIs for third-party authentication through its authentication services and partner management. MOSIP supports OAuth 2.0, OpenID Connect, and can integrate with SAML-based authentication systems. MOSIP includes secure API gateways, authentication tokens, and comprehensive access controls for third-party integrations. MOSIP includes partner management capabilities with proper onboarding, certification, and ongoing monitoring processes.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.O6 ",
    "title": "S.SAA.O6  Change control/incident tickets present",
    "overall_score": "100%",
    "notes": "MOSIP provides frameworks for change management and incident tracking through its operational procedures. MOSIP includes detailed change management procedures and deployment guidelines with proper approval workflows. MOSIP includes incident response procedures and monitoring capabilities for tracking and resolving security incidents. MOSIP integrates change control and incident management with its comprehensive security monitoring and audit capabilities.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.O7",
    "title": "S.SAA.O7 AC system log contains denied access requests",
    "overall_score": "100%",
    "notes": "MOSIP includes detailed access control logging that captures all denied access attempts with timestamps and context. MOSIP provides real-time monitoring capabilities for access control events and security violations. MOSIP comprehensively logs all access requests including third-party integrations and internal user activities. MOSIP provides both real-time monitoring dashboards and historical log analysis capabilities for security investigations.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.O8",
    "title": "S.SAA.O8 AC system log contains granted access requests",
    "overall_score": "100%",
    "notes": "MOSIP includes detailed access control logging that captures all granted access attempts with full audit trails. MOSIP provides monitoring capabilities for analyzing granted access patterns and compliance verification. MOSIP comprehensively logs all successful access requests including third-party integrations with detailed context and user information. MOSIP integrates granted access logging with security monitoring and incident response procedures for comprehensive security analysis.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SAA.O9",
    "title": "S.SAA.O9 False acception rate (100%-FAR)",
    "overall_score": "100%",
    "notes": "MOSIP includes biometric authentication with configurable false acceptance rate thresholds and quality metrics. MOSIP provides authentication analytics and monitoring capabilities to track FAR metrics and authentication performance. MOSIP allows configuration of biometric matching thresholds and quality parameters to control false acceptance rates. MOSIP includes comprehensive audit logging and analysis capabilities for authentication events including false acceptance detection.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SC.D1",
    "title": "S.SC.D1 Provision for communication and protection policies",
    "overall_score": "100%",
    "notes": "MOSIP establishes comprehensive communication and protection policies as part of its security framework. MOSIP's policies include network segmentation, boundary protection, and comprehensive cryptography implementation. MOSIP defines acceptable communication channels and authentication mechanisms through its security and API frameworks. MOSIP's policy framework includes regular review and update processes for communication and protection requirements.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SC.D2",
    "title": "S.SC.D2 Directives for boundary protection",
    "overall_score": "100%",
    "notes": "MOSIP establishes comprehensive boundary protection guidelines as part of its security architecture. MOSIP's boundary protection includes network perimeter security, access controls, and comprehensive traffic monitoring. MOSIP integrates boundary protection directives with its network architecture and comprehensive security control framework. MOSIP's security framework includes regular review and updates of boundary protection directives based on evolving threats.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SC.D3",
    "title": "S.SC.D3 Provision for control guidelines in conformance with NIST SP800-53",
    "overall_score": "100%",
    "notes": "MOSIP establishes comprehensive control guidelines that align with NIST SP800-53 security control requirements. MOSIP's guidelines include system categorization, comprehensive access controls, and security implementation aligned with NIST SP800-53. MOSIP implements NIST SP800-53 control families appropriate for identity management system requirements. MOSIP's framework includes regular review and updates to maintain compliance with NIST SP800-53 requirements.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SC.D4",
    "title": "S.SC.D4 Provision for Guidelines NIST SP 800-41",
    "overall_score": "100%",
    "notes": "MOSIP establishes comprehensive firewall and network security guidelines aligned with NIST SP 800-41 recommendations. MOSIP's security framework includes firewall policy development, implementation, and management guidelines. MOSIP implements firewall configuration and monitoring practices consistent with NIST SP 800-41 guidelines. MOSIP's security framework includes regular review and updates of firewall guidelines based on NIST SP 800-41 and security best practices.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SC.D5",
    "title": "S.SC.D5 Provision for Guidelines NIST SP 800-189",
    "overall_score": "100%",
    "notes": "MOSIP establishes comprehensive network security guidelines that include interdomain traffic exchange protection. MOSIP's security framework includes network protection strategies covering BGP security and DDoS mitigation approaches. MOSIP implements resilient traffic exchange practices consistent with NIST SP 800-189 guidelines for network security. MOSIP's security framework includes regular review and updates of network security guidelines for effective traffic exchange protection.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SC.D6",
    "title": "S.SC.D6 Provision for Guidelines NIST SP 800-77",
    "overall_score": "100%",
    "notes": "MOSIP establishes comprehensive secure communication guidelines that include VPN and encrypted communication protocols. MOSIP's security framework includes secure communication protocols and encrypted tunnel management consistent with VPN best practices. MOSIP implements secure communication practices that align with NIST SP 800-77 VPN security guidelines. MOSIP's security framework includes regular review and updates of secure communication guidelines for effective network protection.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SC.D7",
    "title": "S.SC.D7 Provision for Guidelines NIST SP 800-94",
    "overall_score": "100%",
    "notes": "MOSIP establishes comprehensive security monitoring guidelines that include intrusion detection and prevention capabilities. MOSIP's security framework includes monitoring and detection systems consistent with NIST SP 800-94 guidelines. MOSIP implements security monitoring and detection practices aligned with NIST SP 800-94 intrusion detection guidelines. MOSIP's security framework includes regular review and updates of monitoring guidelines for effective threat detection and prevention.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SC.D8",
    "title": "S.SC.D8 Provision for Network control implementation guidelines ISO 27001",
    "overall_score": "100%",
    "notes": "MOSIP establishes comprehensive network control guidelines aligned with ISO 27001 requirements. MOSIP's security framework includes comprehensive network security management and control implementation consistent with ISO 27001. MOSIP implements and documents network security controls according to ISO 27001 standards. MOSIP's framework includes regular review and updates of network control guidelines to maintain ISO 27001 compliance.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SC.O1",
    "title": "S.SC.O1 Application of communication and protection policies",
    "overall_score": "100%",
    "notes": "MOSIP applies comprehensive communication and protection policies across all system operations and components. MOSIP implements network segmentation, boundary protection, and comprehensive cryptography according to established policies. MOSIP maintains communication channel authenticity and security through comprehensive policy implementation. MOSIP includes monitoring and evaluation capabilities to ensure effective policy application and compliance.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SC.O10",
    "title": "S.SC.O10 Application partitioning",
    "overall_score": "100%",
    "notes": "MOSIP follows a microservices architecture with clear partitioning between different functional modules. Each MOSIP service is containerized and can be deployed, scaled, and maintained independently with secure communication between services.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SC.O11",
    "title": "S.SC.O11 Session authenticity",
    "overall_score": "100%",
    "notes": "MOSIP uses JWT tokens, OAuth 2.0, and multi-factor authentication for session management with proper session timeouts and integrity protection. MOSIP provides secure session invalidation and cleanup mechanisms across all services.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SC.O13",
    "title": "S.SC.O13 Process isolation",
    "overall_score": "100%",
    "notes": "MOSIP uses containerization with Docker and Kubernetes for complete process isolation between services with comprehensive sandboxing and resource isolation. MOSIP implements Kubernetes RBAC, network policies, and comprehensive logging for process monitoring.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SC.O14",
    "title": "S.SC.O14 Usage restriction",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive access controls and usage policies based on roles and permissions with privacy-by-design approaches. MOSIP follows Fair Information Practice Principles and provides monitoring, auditing, and automated enforcement of usage policies.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SC.O2",
    "title": "S.SC.O2 Network Segmentation established",
    "overall_score": "100%",
    "notes": "MOSIP establishes comprehensive network segmentation as part of its security architecture and deployment framework. MOSIP's architecture includes proper isolation of critical systems and secure data flow management through network segmentation. MOSIP includes monitoring and maintenance capabilities to ensure network segmentation controls remain effective. MOSIP's framework supports regular review and updates of network segmentation based on evolving security requirements.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SC.O3",
    "title": "S.SC.O3 Separation of system and user functionality",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive separation of functionality between system administration and user operations. MOSIP isolates administrative interfaces and implements comprehensive access controls for system and user functionality separation. MOSIP includes comprehensive privilege separation and role-based access controls to maintain functionality separation. MOSIP includes monitoring and maintenance capabilities to ensure effective separation of system and user functionality.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SC.O4",
    "title": "S.SC.O4 Segregation of IDMS internal network zones",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive network zone segregation for identity management system components based on security requirements. MOSIP includes comprehensive access controls and network isolation mechanisms for effective zone segregation. MOSIP includes monitoring and maintenance capabilities to ensure effective segregation of internal network zones. MOSIP's framework supports regular review and updates of network zone segregation based on changing security needs.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SC.O5",
    "title": "S.SC.O5 DoS Protection",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive DoS protection mechanisms as part of its security architecture and network protection. MOSIP's security framework includes traffic management, rate limiting, and attack detection capabilities for DoS protection. MOSIP includes monitoring and maintenance capabilities to ensure DoS protection remains effective against evolving attack methods. MOSIP's security framework supports regular testing and updates of DoS protection based on threat intelligence and security best practices.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SC.O6",
    "title": "S.SC.O6 Monitor and control communications at the external managed interfaces",
    "overall_score": "100%",
    "notes": "MOSIP implements comprehensive communication monitoring and control for external managed interfaces and third-party integrations. MOSIP includes security validation, authorization, and comprehensive traffic analysis for external interface communications. MOSIP includes comprehensive logging and auditing capabilities for external managed interface communications and security compliance. MOSIP's framework supports regular review and updates of external interface monitoring and control for effective security management.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SC.O7",
    "title": "S.SC.O7 Subnetworks for publicly accessible IDMS components",
    "overall_score": "100%",
    "notes": "MOSIP follows a multi-tier architecture with clear network segmentation between public-facing services and internal components. MOSIP deploys public services in dedicated DMZ zones with restricted access to backend systems. MOSIP uses network security groups, firewalls, and API gateways to control inter-segment communication. MOSIP provides comprehensive logging and monitoring for all network segments including public-facing zones.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SC.O9",
    "title": "S.SC.O9 Encrypted firewall(s) password",
    "overall_score": "100%",
    "notes": "MOSIP uses secure credential management and encrypted storage for all infrastructure passwords including firewall configurations. MOSIP implements industry-standard encryption algorithms (AES-256) for credential protection. MOSIP uses dedicated secret management systems like Kubernetes secrets and external key management services. MOSIP deployment guidelines include regular credential rotation for all infrastructure components including firewalls.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SSO.D1",
    "title": "S.SSO.D1 Provision for open SSO standards support",
    "overall_score": "100%",
    "notes": "MOSIP supports open SSO standards including OAuth 2.0 and OpenID Connect through its Keycloak integration. MOSIP provides standardized API interfaces for SP and IdP integration following industry standard protocols. MOSIP enables interoperability with external IdPs through federated authentication capabilities and standard protocols. MOSIP's SSO implementations are compliant with OpenID Connect and OAuth 2.0 specifications as documented in its authentication architecture.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "unknown"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.SSO.D2",
    "title": "S.SSO.D2 Provision for 3rd party MFA support",
    "overall_score": "75%",
    "notes": "MOSIP supports integration with third-party MFA providers through its Keycloak integration and extensible authentication framework. MOSIP provides standardized interfaces through Keycloak's Service Provider Interface (SPI) for integrating external MFA solutions. MOSIP supports multiple MFA methods including biometric authentication and can integrate with various MFA technologies. While MOSIP supports third-party MFA integration, comprehensive security validation frameworks for all possible third-party MFA solutions may require additional assessment.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.SSO.D3",
    "title": "S.SSO.D3 Provision for IWA",
    "overall_score": "25%",
    "notes": "MOSIP does not natively support IWA as it is designed as a platform-agnostic identity management system rather than Windows-specific. MOSIP can integrate with Windows Active Directory through Keycloak's LDAP/AD integration capabilities. MOSIP does not natively support Kerberos or NTLM protocols, focusing instead on modern web-based authentication standards. While MOSIP can integrate with AD, it does not provide native Windows domain-based authentication capabilities.",
    "questions": [
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.SSO.D4",
    "title": "S.SSO.D4 Provision for self-service password reset (SSPR)",
    "overall_score": "75%",
    "notes": "MOSIP provides self-service capabilities through its Keycloak integration which includes password reset functionality. MOSIP supports secure alternate authentication factors through Keycloak's configurable authentication flows and multi-factor reset options. MOSIP implements security controls including rate limiting, token expiration, and secure reset processes as part of its authentication framework. While MOSIP has comprehensive audit logging, specific audit trails for SSPR activities may require additional configuration.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.SSO.D5",
    "title": "S.SSO.D5 Sign-in frequency control policy defined",
    "overall_score": "75%",
    "notes": "MOSIP implements rate limiting and frequency controls through its authentication services to prevent automated attacks. MOSIP provides configurable thresholds and rate limiting mechanisms that can be adjusted based on security requirements and deployment needs. MOSIP implements account protection mechanisms including temporary blocking and security controls for excessive authentication attempts. While MOSIP has frequency control capabilities, specific documentation of sign-in frequency policies and regular review procedures may require organizational implementation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.SSO.O1",
    "title": "S.SSO.O1 Privacy preserving MFA techniques deployed",
    "overall_score": "75%",
    "notes": "MOSIP deploys privacy-preserving biometric authentication using secure biometric templates and privacy-protecting mechanisms. MOSIP's MFA implementations are designed to minimize personal data exposure through secure authentication protocols and data minimization principles. MOSIP's authentication architecture is designed to comply with privacy regulations through privacy-by-design principles and data protection measures. While MOSIP has privacy-preserving features, specific anonymity or pseudonymity options for MFA may require additional configuration depending on use case requirements.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.SSO.O2",
    "title": "S.SSO.O2 MFA usage patterns Analyser deployed",
    "overall_score": "50%",
    "notes": "MOSIP includes audit and monitoring capabilities that can track and analyze authentication patterns and user behavior. While MOSIP has monitoring capabilities, specific analytics for MFA adoption rates and effectiveness across user groups may require additional implementation. MOSIP's monitoring and logging systems can support automated analysis and identification of suspicious authentication patterns. While MOSIP provides data for analysis, specific tools for optimizing MFA deployment based on usage patterns may require additional development.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.SSO.O3",
    "title": "S.SSO.O3 Upper limit for the number of temporary verification codes",
    "overall_score": "75%",
    "notes": "MOSIP implements limits and controls for temporary verification codes through its authentication services and security configurations. MOSIP enforces rate limiting for verification code generation as part of its security controls to prevent abuse and brute force attacks. MOSIP provides configurable security parameters including verification code limits that can be adjusted based on deployment requirements. While MOSIP has monitoring capabilities, specific alerting for excessive verification code generation may require additional configuration and implementation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.SSO.O4",
    "title": "S.SSO.O4 Sign-in frequency control policy implemented",
    "overall_score": "100%",
    "notes": "MOSIP actively implements and enforces sign-in frequency controls through its authentication services with built-in rate limiting mechanisms. MOSIP automatically blocks and throttles excessive sign-in attempts as part of its security controls to prevent brute force and automated attacks. MOSIP implements frequency controls across all authentication endpoints ensuring comprehensive protection against automated attacks. MOSIP provides monitoring capabilities that can track and alert on sign-in frequency violations and security events.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      }
    ]
  },
  {
    "code": "S.VM.D1",
    "title": "S.VM.D1 Vulnerability potential",
    "overall_score": "75%",
    "notes": "MOSIP follows secure development practices and has security guidelines for vulnerability assessment and secure design principles. However, specific documentation of vulnerability potential assessments for risk management may require additional implementation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.VM.D3",
    "title": "S.VM.D3 Provision for patch management",
    "overall_score": "50%",
    "notes": "MOSIP provides deployment procedures that include guidance for updates and patch management with testing guidelines. However, MOSIP does not include built-in automated patch management tools and may require additional implementation for patch tracking and compliance documentation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.VM.D4",
    "title": "S.VM.D4 Provision for checklists and testing procedures in place",
    "overall_score": "75%",
    "notes": "MOSIP provides security guidelines and testing procedures as part of its security framework with standardized testing procedures and security assessment checklists. However, regular updates to address evolving threat landscapes may require ongoing maintenance and updates.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.VM.O1",
    "title": "S.VM.O1 Residual vulnerability",
    "overall_score": "50%",
    "notes": "MOSIP can measure residual vulnerabilities through its security framework and has continuous monitoring capabilities. However, specific documentation and assessment of residual vulnerabilities for risk management and security improvement decisions may require additional governance processes.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.VM.O2",
    "title": "S.VM.O2 Patching management in place",
    "overall_score": "50%",
    "notes": "MOSIP has operational patch management guidance through its deployment procedures and includes rollback and recovery procedures. However, regular automated scheduling and deployment along with compliance tracking may require additional operational implementation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.VM.O4",
    "title": "S.VM.O4 Mean-time-to-detect",
    "overall_score": "75%",
    "notes": "MOSIP has detection capabilities through its monitoring systems and audit logging that can measure detection times with automated detection mechanisms. However, specific tracking and improvement of MTTD metrics may require additional security operations implementation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  },
  {
    "code": "S.VM.O5",
    "title": "S.VM.O5 Mean-time-to-resolve",
    "overall_score": "50%",
    "notes": "MOSIP can measure resolution times through its monitoring and incident tracking capabilities with some automated resolution through deployment automation. However, specific optimization for time-based requirements and MTTR metrics tracking may require additional security operations implementation.",
    "questions": [
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      },
      {
        "status": "implemented"
      },
      {
        "status": "not_implemented"
      }
    ]
  }
]